{"createdTime":1724749452496,"shownInTree":["attachments/arfken.png","attachments/blanchard-and-bruening.png","attachments/butkov.png","attachments/gustafson-and-sigal.png","attachments/linear-algebra-done-right.png","attachments/mathematical-physical-chemistry.png","attachments/set-theory-for-the-working-mathematician.png","attachments/teschl.png","attachments/toutube-bright-side-of-mathematics.png","attachments/youtube-gilbert-strang.png","attachments/youtube-michael-penn.png","attachments/youtube-richard-e-borcherds.png","canvas/mathematics-map.html","canvas/quantum-chemistry-map.html","index.html","mathematics-map-details.html","recommended-general-mathematics-reading.html","recommended-youtube-channels.html"],"attachments":["attachments/arfken.png","attachments/blanchard-and-bruening.png","attachments/butkov.png","attachments/gustafson-and-sigal.png","attachments/linear-algebra-done-right.png","attachments/mathematical-physical-chemistry.png","attachments/set-theory-for-the-working-mathematician.png","attachments/teschl.png","attachments/toutube-bright-side-of-mathematics.png","attachments/youtube-gilbert-strang.png","attachments/youtube-michael-penn.png","attachments/youtube-richard-e-borcherds.png","lib/scripts/graph-wasm.wasm","lib/fonts/94f2f163d4b698242fef.otf","lib/fonts/72505e6a122c6acd5471.woff2","lib/fonts/2d5198822ab091ce4305.woff2","lib/fonts/c8ba52b05a9ef10f4758.woff2","lib/fonts/cb10ffd7684cd9836a05.woff2","lib/fonts/b5f0f109bc88052d4000.woff2","lib/fonts/cbe0ae49c52c920fd563.woff2","lib/fonts/535a6cf662596b3bd6a6.woff2","lib/fonts/70cc7ff27245e82ad414.ttf","lib/fonts/454577c22304619db035.ttf","lib/fonts/52ac8f3034507f1d9e53.ttf","lib/fonts/05b618077343fbbd92b7.ttf","lib/fonts/4bb6ac751d1c5478ff3a.woff2","lib/media/874d8b8e340f75575caa.svg","lib/fonts/mathjax_zero.woff","lib/fonts/mathjax_main-regular.woff","lib/fonts/mathjax_main-bold.woff","lib/fonts/mathjax_math-italic.woff","lib/fonts/mathjax_main-italic.woff","lib/fonts/mathjax_math-bolditalic.woff","lib/fonts/mathjax_size1-regular.woff","lib/fonts/mathjax_size2-regular.woff","lib/fonts/mathjax_size3-regular.woff","lib/fonts/mathjax_size4-regular.woff","lib/fonts/mathjax_ams-regular.woff","lib/fonts/mathjax_calligraphic-regular.woff","lib/fonts/mathjax_calligraphic-bold.woff","lib/fonts/mathjax_fraktur-regular.woff","lib/fonts/mathjax_fraktur-bold.woff","lib/fonts/mathjax_sansserif-regular.woff","lib/fonts/mathjax_sansserif-bold.woff","lib/fonts/mathjax_sansserif-italic.woff","lib/fonts/mathjax_script-regular.woff","lib/fonts/mathjax_typewriter-regular.woff","lib/fonts/mathjax_vector-regular.woff","lib/fonts/mathjax_vector-bold.woff","lib/html/file-tree.html","lib/scripts/webpage.js","lib/scripts/graph-view.js","lib/scripts/graph-wasm.js","lib/scripts/graph-render-worker.js","lib/scripts/tinycolor.js","lib/scripts/pixi.js","lib/scripts/minisearch.js","lib/media/favicon.png","lib/scripts/graph-data.js","lib/styles/obsidian.css","lib/styles/global-variable-styles.css","lib/styles/main-styles.css","lib/styles/snippets.css","lib/metadata.json","lib/search-index.json"],"allFiles":["recommended-youtube-channels.html","recommended-general-mathematics-reading.html","index.html","mathematics-map-details.html","attachments/set-theory-for-the-working-mathematician.png","attachments/youtube-richard-e-borcherds.png","attachments/youtube-gilbert-strang.png","attachments/youtube-michael-penn.png","attachments/toutube-bright-side-of-mathematics.png","attachments/blanchard-and-bruening.png","attachments/gustafson-and-sigal.png","attachments/linear-algebra-done-right.png","attachments/arfken.png","attachments/teschl.png","attachments/mathematical-physical-chemistry.png","attachments/butkov.png","canvas/mathematics-map.html","canvas/quantum-chemistry-map.html","lib/scripts/graph-wasm.wasm","lib/fonts/94f2f163d4b698242fef.otf","lib/fonts/72505e6a122c6acd5471.woff2","lib/fonts/2d5198822ab091ce4305.woff2","lib/fonts/c8ba52b05a9ef10f4758.woff2","lib/fonts/cb10ffd7684cd9836a05.woff2","lib/fonts/b5f0f109bc88052d4000.woff2","lib/fonts/cbe0ae49c52c920fd563.woff2","lib/fonts/535a6cf662596b3bd6a6.woff2","lib/fonts/70cc7ff27245e82ad414.ttf","lib/fonts/454577c22304619db035.ttf","lib/fonts/52ac8f3034507f1d9e53.ttf","lib/fonts/05b618077343fbbd92b7.ttf","lib/fonts/4bb6ac751d1c5478ff3a.woff2","lib/media/874d8b8e340f75575caa.svg","lib/fonts/mathjax_zero.woff","lib/fonts/mathjax_main-regular.woff","lib/fonts/mathjax_main-bold.woff","lib/fonts/mathjax_math-italic.woff","lib/fonts/mathjax_main-italic.woff","lib/fonts/mathjax_math-bolditalic.woff","lib/fonts/mathjax_size1-regular.woff","lib/fonts/mathjax_size2-regular.woff","lib/fonts/mathjax_size3-regular.woff","lib/fonts/mathjax_size4-regular.woff","lib/fonts/mathjax_ams-regular.woff","lib/fonts/mathjax_calligraphic-regular.woff","lib/fonts/mathjax_calligraphic-bold.woff","lib/fonts/mathjax_fraktur-regular.woff","lib/fonts/mathjax_fraktur-bold.woff","lib/fonts/mathjax_sansserif-regular.woff","lib/fonts/mathjax_sansserif-bold.woff","lib/fonts/mathjax_sansserif-italic.woff","lib/fonts/mathjax_script-regular.woff","lib/fonts/mathjax_typewriter-regular.woff","lib/fonts/mathjax_vector-regular.woff","lib/fonts/mathjax_vector-bold.woff","lib/html/file-tree.html","lib/scripts/webpage.js","lib/scripts/graph-view.js","lib/scripts/graph-wasm.js","lib/scripts/graph-render-worker.js","lib/scripts/tinycolor.js","lib/scripts/pixi.js","lib/scripts/minisearch.js","lib/media/favicon.png","lib/scripts/graph-data.js","lib/styles/obsidian.css","lib/styles/global-variable-styles.css","lib/styles/main-styles.css","lib/styles/snippets.css"],"webpages":{"canvas/mathematics-map.html":{"title":"Mathematics Map","icon":"","description":"<br><br>\n<br>Integers\n<br>Real and complex numbers\n<br><br><a href=\".?query=tag:esqc\" class=\"tag is-unresolved\" target=\"_self\" rel=\"noopener\" data-href=\"#esqc\">#esqc</a><br><br>We here (link to map: <a data-tooltip-position=\"top\" aria-label=\"Mathematics Map.canvas\" data-href=\"Mathematics Map.canvas\" href=\"/canvas/mathematics-map.html\" class=\"internal-link\" target=\"_self\" rel=\"noopener\">Mathematics Map</a>) try to outline, graphically, a set of mathematical topics, and how they are relevant for the study of quantum chemistry. The subdivision of mathematical topics is largely artificial and biased as there there is no rigorous way to do such a thing. <br>Each box contains one field, or topic, and they are connected to other boxes with the arrow indicating the direction from \"more general\" to \"less general and more special\".<br>In a second visualization (<a data-tooltip-position=\"top\" aria-label=\"Quantum Chemistry Map.canvas\" data-href=\"Quantum Chemistry Map.canvas\" href=\"/canvas/quantum-chemistry-map.html\" class=\"internal-link\" target=\"_self\" rel=\"noopener\">link to canvas</a>) we try to organize the various topics of theoretical and quantum chemistry in relation to the mathematical map.<br>Of course, many more arrows could be drawn, and many more boxes could be added. In order to make the graph not too cluttered and confusing, we keep only main links.<br>NOTE: Topics marked with a are considered of prime importance to any quantum chemist, regardless of their specialization.<br><br>Logic is the branch of mathematics and philosophy that deals with reasoning, the principles of valid inference, and the structure of propositions, i.e., mathematical statements. It provides the formal framework used to analyze and construct mathematical proofs, ensuring that conclusions follow from premises in a valid and systematic way.<br>Set theory is the branch of mathematics that studies sets, which are collections of objects. In set theory, everything is a set. It forms the foundation for much (all?) of modern mathematics, providing the language and basic concepts used to describe and analyze mathematical structures. Set theory forms the foundation in the sense that every other mathematical theory can be formalized in the language of set theory.<br>Most mathematicians are aware of formal set theory, but the \"version\" used in most contexts is \"naive set theory\", which in a more informal manner defines mathematical sets compared to the rigorous axiom based constructions. As Russel's Paradox shows us, naive set theory has some pitfalls. Most mathematicians simply avoid these pitfalls and stick to naive set theory.<br>Although formal set theory is unlikely to be applied in the study of quantum chemistry, the basic notation is widely-used and an important language tool when specifying computational methods and their implementation. <br>Recommended reading:<br>\n<br>\"Set Theory for the Working Mathematician\" by - Krzysztof Ciesielski, Cambridge University Press (1997) <a rel=\"noopener\" class=\"external-link is-unresolved\" href=\"https://doi.org/10.1017/CBO9781139173131\" target=\"_self\">https://doi.org/10.1017/CBO9781139173131</a>\n<br>\n<br><br>Category theory is a branch of mathematics that provides a high-level, abstract framework for describing and analyzing mathematical structures and their relationships. It was developed in the 1940s by Samuel Eilenberg and Saunders Mac Lane, and has found applications across nearly all areas of mathematics, as well as in computer science, logic, and theoretical physics.<br>One of the useful aspects of category theory is that it gives a rigorous language for comparing different mathematical concepts and structures, such as groups and vector spaces.<br>Although direct use of category theory in quantum chemistry is rare, it is mentioned here as an important branch of modern mathematics.<br>Recommended reading:<br>\n<br>...\n<br><br>In abstract algebra, sets are given mathematical structure in the form of binary operations and various axioms that define what it is to be, e.g., a group. Thus, a group is defined in terms of its essential features, and not its concrete realizations. For example, the group with group operation of addition modulo 4, compared to the matrix group consisting of powers of the matrix .<br>Important algebraic constructions include groups, semigroups, rings, modules, vector spaces, and algebras.<br>Abstract algebra is important for quantum chemistry, since it lays the foundation for linear algebra, one of the most important tools of the scientist, and the study of molecular symmetries and groups.<br>Recommended reading:<br>\n<br>...\n<br><br>Group theory is the study of abstract groups and their representations. Lie groups are groups that are also differentiable manifolds (see Differential Geometry). Group theory permeates theoretical physics and chemistry, giving an axiomatic treatment of symmetry. Representation theory studies groups represented as linear operators or matrices acting on vector spaces.<br>In chemistry, molecular symmetries and point groups are useful for understanding molecular behavior and also eases interpretation of spectroscopic experiments. Spectroscopic notation is a consequence of conservation of angular momentum. Representation theory is applied to explain the symmetries of molecular orbitals. Having a grasp of group theory is absolutely essential for the quantum chemist.<br>Recommended reading:<br>\n<br>... <br><br>The axiomatic definition of the natural numbers using set theory is one of the simplest examples of how set theory serves as foundation for mathematics. The natural numbers are again used to define the integers, rational numbers, real numbers, and complex numbers. These sets are of course among the most important mathematical objects in the sciences. The number systems are again examples of algebraic structures: the integers form a group under addition, the real and complex numbers form fields.<br>Clearly, understanding numbers is essential to any scientific study. On the other hand, for most purposes, intuitive notions about integers, reals, and complex numbers will be sufficient.<br>Recommended reading:<br>\n<br> <br> <br><br>Topology is the study of open and closed sets, and the concept of continuity. A topological space is a set together with a collection of subsets called open subsets, and axioms that these have to obey. From this, topological spaces are generated, allowing us to talk about \"closeness\" of elements in the set. For example, a metric is an example of a structure that gives rise to a particular kind of topology, that formalizes the notion of distance between points.<br>In topology the notion of sequences and their convergence is made abstract, including the notion of continuous functions. Topological arguments are indispensable for mathematical analysis of partial differential equations.<br>For quantum chemists, being aware of the various notions of topology is useful to navigate the literature. For example, the convergence of the pseudocontinuum of the FCI method can be formalized with topological notions. As another example, in density-functional theory, what does it mean that two electronic densities are close together? Being able to distinguish different notions of \"closeness of densities\" is imperative for understanding, say, modes of convergence of SCF iterations.<br>Recommended reading:<br>\n<br>...\n<br><br>Measure theory develops abstract notions of length, area, volume, etc., and allows to speak about such notions in potentially very abstract spaces. For example, the Dirac delta function is rigorously defined using measure theory. <br>The Lebesgue integral is based on the notion of a Borel measure, and generalizes the Riemann integral. With the Lebesgue integral we can integrate many more functions compared to the Riemann integral, and operations like exchanging limits and integrals or integration variables obey well-defined and simple theorems. The Lebesgue integral is also necessary to define the Hilbert space of quantum mechanics. <br>A passing knowledge if measure theory is very useful for the quantum chemist, since much of the language used in mathematical physics relies on these concepts. That being said, detailed theorems are rarely used, except in borderline cases, where apparent paradoxes may arise. In those cases, these paradoxes are resolved by checking the conditions for, say, interchange of limits and integration.<br>Recommended reading:<br>\n<br>...\n<br><br>With distribution theory one extends the concept of functions to include objects, known as distributions or generalized functions, which can be used to rigorously define operations like differentiation even for functions that are not classically differentiable. This theory is particularly useful in handling singularities or discontinuities, such as the Dirac delta function, which models an infinitely concentrated point of mass or charge. Distribution theory provides a powerful framework for solving partial differential equations, e.g., using Green's functions.<br>A rudimentary knowledge of distribution theory is very useful in the study of quantum mechanics. The standard informal view is that \"the Dirac delta is a function which is infinite everywhere except at a single point where it is infinity\", similarly that \"the Green's function is the response of the system to a Dirac delta function\", is very useful, but will only take one so far.<br>Useful in (for example):<br>\n<br>Response theory\n<br>Manybody Green's function theory\n<br>Electromagnetism\n<br>Recommended reading:<br>\n<br>...\n<br><br>In linear algebra, one studies linear vector spaces and linear functions between such spaces. Typical, and indeed archetypal, examples are and , and matrices with complex or real entries. It is no exaggeration that linear algebra is perhaps the most important tool in science, being at the heart of everything from quantum mechanics, data analysis, and numerical methods for the solution of partial differential equations.<br>Having a good command of linear algebra is absolutely essential to any theoretical chemist, from the LCAO approach to molecular orbitals, via practical realizations of Kohn--Sham density functional theory, to the numerical solution of, say, the coupled-cluster method.<br>Recommended reading:<br> \"Linear Algebra Done Right\" by Sheldon Axler\n<img alt=\"Linear Algebra Done Right.png\" src=\"/attachments/linear-algebra-done-right.png\" style=\"width: 300px; max-width: 100%;\" target=\"_self\">\nA highly regarded undergraduate text in linear algebra, considered a very fine piece of didacic writing. Open access. Available for free on the Author's web page: <a rel=\"noopener\" class=\"external-link is-unresolved\" href=\"https://linear.axler.net/\" target=\"_self\">https://linear.axler.net/</a>\n<br><br>In multilinear algebra, linear maps between vector spaces are generalized to maps over several vector spaces to several vector spaces at once, i.e., tensors. Multilinear algebra is rarely taught together with linear algebra, but could well be a subtopic in an advanced course, especially considering it is an important part of modern machine learning methodology. Multilinear algebra finds important use cases in differential geometry, as well as appearing naturally in calculus of several variables. Tensors are also integral to manybody methods like coupled-cluster theory or configuration-interaction theort.<br>Multilinear algebra is among the more useful topics for quantum chemists.<br>Recommended reading:<br>\n<br>...\n<br><br>Calculus is the branch of mathematics that studies continuous change and is divided into two main areas: differential calculus and integral calculus. Differential calculus focuses on the concept of the derivative, rates of change. Integral calculus, on the other hand, deals with the concept of the integral.<br>Multivariate calculus extends to functions of several variables, encompassing the study of partial derivatives, multiple integrals, and vector calculus. <br>Calculus, together with linear algebra, forms the foundation for much of modern science. It is absolutely essential to have a good grasp of calculus and multivariate calculus for theoretical chemists.<br>Recommended reading:<br>\n<br>...\n<br><br>Complex analysis studies the calculus of functions of complex variables. For complex functions, being differentiable is a much more restricting requirement than for real functions, leading to surprising and very strong results of great use in physics and chemistry. Since real functions often are special cases of complex functions, complex analysis is very useful even if complex numbers do not show up at all in a theory.<br>Useful in: Response theory, quantum dynamics, integral evaluation, perturbation theory, to name a few.<br>Complex analysis is among the more useful topics for quantum chemists.<br>Recommended reading:<br>\n<br>....\n<br><br>Differential geometry studies curves, surfaces, and higher-dimensional analogues from an abstract perspective, called differentiable manifolds. These are characterized by the fact that they somehow are smooth, and that locally, i.e., in for sufficiently small neighborhoods of points (if one zooms in on any point), they look like flat space, i.e., (or for complex manifolds). Thus, differential geometry combines multivariate calculus and linear algebra. One has infinite dimensional versions of the theory, as well, where the modelling spaces are infinite dimensional Banach or Hilbert spaces.<br>Differential geometry is very useful for abstract understanding of manybody wavefunction methods. For example, the concept of orbital invariance in CASSCF, or the manifold structure of the Hartree-Fock or coupled-cluster methods. See also lie group theory.<br>Differential geometry is also the foundation for general relativity, and, to a lesser extent, special relativity.<br>Differential geometry is among the more useful branches of mathematics for quantum chemistry students.<br>Recommended reading:<br>\n<br>...\n<br><br>Convex analysis deals with convex sets and functions. It is an important branch of mathematics, since many optimization problems in science enjoy the property of convexity. Convex analysis introduces a duality transformation, the Legendre-Fenchel transformation, which in many ways are analogous to the Fourier transform.<br>Convex analysis plays a prominent role in the mathematical foundation of DFT, as pioneered by E.H. Lieb. The Legendre-Fenchel transformation is also important in thermodynamics.<br>Convex analysis is a useful topic, especially if one wants to study DFT.<br>Recommended reading:<br>\n<br>...\n<br><br>Functional analysis can be viewed as infinite dimensional linear algebra. Here, complete normed spaces (Banach spaces) and complete inner product spaces (Hilbert spaces) are studied, along with linear operators between such spaces. Functional analysis is the foundation of quantum mechanics, as done by J. von Neumann. In a way, one can say that the development of functional analysis in the early 20th century was motivated by placing quantum mechanics on rigorous ground.<br>Functional analysis also provides the mathematical language for abstract treatment of PDEs such as the Schrödinger equation, the Kohn--Sham approach to DFT, Maxwell's equations, and so on.<br>Functional analysis is a very useful topic for quantum chemists, especially when you want to navigate the more mathematics heavy literature.<br>Recommended reading:<br>\n<br>...\n<br><br>Calculus of variations deals with the optimization of nonlinear functionals, functions that map functions to scalars. Calculus of variations generalizes vector calculus to infinite dimensions, and as such could also be called \"nonlinear functional analysis\". Calculus of variations is the correct framework for variational formulations of the laws of nature, from quantum field theory and QED to Hamilton's equations of motion. Moreover, nonlinear approximations to the molecular Schrödinger equation such as Hartree-Fock is naturally formulated in this language.<br>To have a basic grasp of calculus of variations is almost essential to quantum chemists. A basic knowledge does not require advanced functional analysis, even if the above paragraph gives such an expression.<br>Calculus of variations is thus an exceedingly important topic in quantum chemistry.<br>Recommended reading:<br>\n<br>Goldstein, Safko and Poole, \"Classical Mechanics\"\n<br>Zeidler, \"Nonlinear functional analysis\"\n<br>...\n<br><br>Ordinary differential equations (ODEs) describe initial value and boundary value problems of scalar quantities, or coupled such equations. From classical mechanics to rate equations, ODEs permeate theoretical chemistry, and having a basic understanding of essential mathematical results is absolutely essential.<br>Recommended reading:<br>\n<br>...\n<br><br>Partial differential equations (PDEs) generalize ODEs to infinite dimensions, i.e., initial and boundary value problems where the unknown is no longer a scalar or a vector, but an element in a function space. Laws such as Einstein's gravitation theory, transport of heat, chemical reaction-diffusion systems, Maxwell's equations, the various Schrödinger equations, are all PDEs.<br>PDEs are very important for quantum chemistry.<br>Recommended reading:<br>\n<br>...\n<br>...\n<br><br>In operator algebra, one studies algebras of operators over linear spaces, often Hilbert spaces. The algebras are often given structures inspired by quantum mechanics, such as canonical anticommutator or canonical commutator relations, e.g. the CAR and CCR algebras. It is a highly abstract branch of pure mathematics, and understanding the basic notions and results may be very useful for the study of manybody theory and quantum field theories.<br>Recommended reading:<br>\n<br>...\n<br>...\n<br><br>Most equations in quantum chemistry cannot be solved analytically, and must be approximated in finite precision arithmetic on computers. This is the area of numerical analysis. Here, numerical methods for differential equations are studied, as well as numerical linear algebra and eigenvalue finding algorithms, to name some topics.<br>Numerical analysis is very important for developing and understanding computer implementations of quantum chemistry algorithms.<br>Recommended reading:<br>\n<br>...\n<br><br>Optimization, really a subfield of numerical analysis, deals with finding local or global extremal points of functions of several variables, as well as finding roots of systems of nonlinear equations. There are a multitude of algorithms, such as the method of steepest descent, Newton, and quasi-Newton methods. A very important topic for students of quantum chemistry, as many computational problems end up as an optimization problem.<br>Recommended reading:<br>\n<br>...\n<br>\nMathematics Map Details<br><br><br>\n<br>Vector spaces, matrices, ...\n<br>Norm, inner product ...\n<br><br>\n<br>Combinatorics\n<br>Graph theory\n<br>Number theory\n<br>Algorithms and complexity\n<br><br>\n<br>Foundations of mathematics\n<br>Axioms, theorems, proofs\n<br>Formal set theory\n<br><br>\n<br>Axiomatic algebraic structures\n<br><br>\n<br>C*-algebras\n<br>Second quantization\n<br><br>\n<br>Infinite dimensions\n<br>Topological vector spaces\n<br>Banach spaces\n<br>Hilbert spaces\n<br><br>\n<br>Convex functions\n<br>Legendre transformations\n<br><br><br>\n<br>Hohenberg--Kohn theory\n<br>Lieb theory\n<br>Kohn-Sham theory\n<br><br><br><br>\n<br>Existence and uniqueness\n<br>Variational formulations\n<br><br>\n<br>Borel measure\n<br>Lebesgue integral\n<br>-spaces\n<br><br>\n<br>Manifolds\n<br>Tensors\n<br>Exterior calculus\n<br><br>\n<br>The theory of complex functions <br><br>\n<br>The theory of functions\n<br>Differentiation and integration\n<br>Series expansions\n<br><br>\n<br>Generalized functions\n<br>Dirac delta\n<br>Fourier transforms\n<br><br>\n<br>Abstract theory of mathematical structure\n<br><br>\n<br>Symmetries\n<br>Discrete groups <br>Lie groups\n<br>Representation theory\n<br><br>\n<br>Open and closed sets\n<br>Continuity and convergence\n<br>Metric spaces\n<br><br>\n<br>Calculus in infinite dimensions\n<br><br>\n<br>Tensors\n<br><br>\n<br>Finite precision arithmetic\n<br>Approximate solution of ODEs and PDEs\n<br>Numerical integration\n<br><br>\n<br>Steepest descent\n<br>Newton and quasi-Newton methods\n<br>Linear programming\n<br>...\n<br><br>\n<br>Molecular Schrödinger equation\n<br>Semiclassical EM treatment\n<br><br>\n<br>Lorenz invariance\n<br>Curved spacetime\n<br>Gravitation\n<br><br>\n<br>Quantum theory of matter-field interactions\n<br>Matter interacting with electromagnetic fields\n<br>Electron spin\n<br><br>\n<br>Maxwell's equations\n<br><br>\n<br>Lagrange mechanics\n<br>Hamiltonian mechanics\n<br><br>\n<br>Non-variational theory\n<br><br>\n<br>Quantum mechanics for many particles\n","aliases":[],"tags":[],"headers":[{"heading":"Number systems","level":3,"id":"Number_systems"},{"heading":"Configuration-Interaction Method","level":3,"id":"Configuration-Interaction_Method"},{"heading":"A mathematical roadmap for quantum chemistry","level":1,"id":"A_mathematical_roadmap_for_quantum_chemistry"},{"heading":"Logic and Set Theory","level":2,"id":"Logic_and_Set_Theory"},{"heading":"Category Theory","level":2,"id":"Category_Theory"},{"heading":"Abstract Algebra","level":2,"id":"Abstract_Algebra"},{"heading":" Group Theory","level":2,"id":"$\\heartsuit$_Group_Theory"},{"heading":"Number systems","level":2,"id":"Number_systems"},{"heading":"Topology","level":2,"id":"Topology"},{"heading":"Measure and integration","level":2,"id":"Measure_and_integration"},{"heading":"Distribution theory","level":2,"id":"Distribution_theory"},{"heading":" Linear Algebra","level":2,"id":"$\\heartsuit$_Linear_Algebra"},{"heading":"Multilinear algebra","level":2,"id":"Multilinear_algebra"},{"heading":" Calculus","level":2,"id":"$\\heartsuit$_Calculus"},{"heading":"Complex analysis","level":2,"id":"Complex_analysis"},{"heading":"Differential Geometry","level":2,"id":"Differential_Geometry"},{"heading":"Convex Analysis","level":2,"id":"Convex_Analysis"},{"heading":"Functional Analysis","level":2,"id":"Functional_Analysis"},{"heading":"Calculus of Variations","level":2,"id":"Calculus_of_Variations"},{"heading":" Ordinary differential equations","level":2,"id":"$\\heartsuit$_Ordinary_differential_equations"},{"heading":"Partial differential equations","level":2,"id":"Partial_differential_equations"},{"heading":"Operator algebra","level":2,"id":"Operator_algebra"},{"heading":"Numerical analysis","level":2,"id":"Numerical_analysis"},{"heading":"Optimization and root finding","level":2,"id":"Optimization_and_root_finding"},{"heading":"Green's Functions","level":3,"id":"Green's_Functions"},{"heading":" Linear algebra","level":3,"id":"$\\heartsuit$_Linear_algebra"},{"heading":"Discrete mathematics","level":3,"id":"Discrete_mathematics"},{"heading":"Logic and Set Theory","level":3,"id":"Logic_and_Set_Theory"},{"heading":"Abstract Algebra","level":3,"id":"Abstract_Algebra"},{"heading":"Operator Algebra","level":3,"id":"Operator_Algebra"},{"heading":"Functional analysis","level":3,"id":"Functional_analysis"},{"heading":"Convex analysis","level":3,"id":"Convex_analysis"},{"heading":"Many-body Perturbation Theory","level":3,"id":"Many-body_Perturbation_Theory"},{"heading":"Density-functional theory","level":3,"id":"Density-functional_theory"},{"heading":"Hartree-Fock theory","level":3,"id":"Hartree-Fock_theory"},{"heading":"Ordinary differential equations","level":3,"id":"Ordinary_differential_equations"},{"heading":"Partial differential equations","level":3,"id":"Partial_differential_equations"},{"heading":"Measure and integration","level":3,"id":"Measure_and_integration"},{"heading":"Differential geometry","level":3,"id":"Differential_geometry"},{"heading":"Complex analysis","level":3,"id":"Complex_analysis"},{"heading":" Calculus","level":3,"id":"$\\heartsuit$_Calculus"},{"heading":"Distribution theory","level":3,"id":"Distribution_theory"},{"heading":"Category theory","level":3,"id":"Category_theory"},{"heading":" Group theory","level":3,"id":"$\\heartsuit$_Group_theory"},{"heading":"Topology","level":3,"id":"Topology"},{"heading":" Calculus of variations","level":3,"id":"$\\heartsuit$_Calculus_of_variations"},{"heading":"Multilinear algebra","level":3,"id":"Multilinear_algebra"},{"heading":"Numerical analysis","level":3,"id":"Numerical_analysis"},{"heading":" Optimization","level":3,"id":"$\\heartsuit$_Optimization"},{"heading":"Nonrelativistic Quantum mechanics","level":3,"id":"Nonrelativistic_Quantum_mechanics"},{"heading":"Special and general relativity","level":3,"id":"Special_and_general_relativity"},{"heading":"Quantum electrodynamics","level":3,"id":"Quantum_electrodynamics"},{"heading":"Classical electromagnetism","level":3,"id":"Classical_electromagnetism"},{"heading":"Classical mechanics","level":3,"id":"Classical_mechanics"},{"heading":"Coupled-Cluster Theory","level":3,"id":"Coupled-Cluster_Theory"},{"heading":"Many-Body Theory","level":3,"id":"Many-Body_Theory"}],"backlinks":["mathematics-map-details.html","index.html"],"links":["?query=tag:esqc","canvas/mathematics-map.html","canvas/quantum-chemistry-map.html","https://doi.org/10.1017/CBO9781139173131","https://linear.axler.net/","canvas/mathematics-map.html#Number_systems","canvas/mathematics-map.html#Configuration-Interaction_Method","canvas/mathematics-map.html#A_mathematical_roadmap_for_quantum_chemistry","canvas/mathematics-map.html#Logic_and_Set_Theory","canvas/mathematics-map.html#Category_Theory","canvas/mathematics-map.html#Abstract_Algebra","canvas/mathematics-map.html#$\\heartsuit$_Group_Theory","canvas/mathematics-map.html#Number_systems","canvas/mathematics-map.html#Topology","canvas/mathematics-map.html#Measure_and_integration","canvas/mathematics-map.html#Distribution_theory","canvas/mathematics-map.html#$\\heartsuit$_Linear_Algebra","canvas/mathematics-map.html#Multilinear_algebra","canvas/mathematics-map.html#$\\heartsuit$_Calculus","canvas/mathematics-map.html#Complex_analysis","canvas/mathematics-map.html#Differential_Geometry","canvas/mathematics-map.html#Convex_Analysis","canvas/mathematics-map.html#Functional_Analysis","canvas/mathematics-map.html#Calculus_of_Variations","canvas/mathematics-map.html#$\\heartsuit$_Ordinary_differential_equations","canvas/mathematics-map.html#Partial_differential_equations","canvas/mathematics-map.html#Operator_algebra","canvas/mathematics-map.html#Numerical_analysis","canvas/mathematics-map.html#Optimization_and_root_finding","canvas/mathematics-map.html#Green's_Functions","canvas/mathematics-map.html#$\\heartsuit$_Linear_algebra","canvas/mathematics-map.html#Discrete_mathematics","canvas/mathematics-map.html#Logic_and_Set_Theory","canvas/mathematics-map.html#Abstract_Algebra","canvas/mathematics-map.html#Operator_Algebra","canvas/mathematics-map.html#Functional_analysis","canvas/mathematics-map.html#Convex_analysis","canvas/mathematics-map.html#Many-body_Perturbation_Theory","canvas/mathematics-map.html#Density-functional_theory","canvas/mathematics-map.html#Hartree-Fock_theory","canvas/mathematics-map.html#Ordinary_differential_equations","canvas/mathematics-map.html#Partial_differential_equations","canvas/mathematics-map.html#Measure_and_integration","canvas/mathematics-map.html#Differential_geometry","canvas/mathematics-map.html#Complex_analysis","canvas/mathematics-map.html#$\\heartsuit$_Calculus","canvas/mathematics-map.html#Distribution_theory","canvas/mathematics-map.html#Category_theory","canvas/mathematics-map.html#$\\heartsuit$_Group_theory","canvas/mathematics-map.html#Topology","canvas/mathematics-map.html#$\\heartsuit$_Calculus_of_variations","canvas/mathematics-map.html#Multilinear_algebra","canvas/mathematics-map.html#Numerical_analysis","canvas/mathematics-map.html#$\\heartsuit$_Optimization","canvas/mathematics-map.html#Nonrelativistic_Quantum_mechanics","canvas/mathematics-map.html#Special_and_general_relativity","canvas/mathematics-map.html#Quantum_electrodynamics","canvas/mathematics-map.html#Classical_electromagnetism","canvas/mathematics-map.html#Classical_mechanics","canvas/mathematics-map.html#Coupled-Cluster_Theory","canvas/mathematics-map.html#Many-Body_Theory"],"author":"","coverImageURL":"","fullURL":"canvas/mathematics-map.html","pathToRoot":"..","createdTime":1724744014996,"modifiedTime":1724744014996,"sourceSize":19187,"sourcePath":"Canvas/Mathematics Map.canvas","exportPath":"canvas/mathematics-map.html","showInTree":true,"treeOrder":0,"attachments":["attachments/linear-algebra-done-right.png"]},"canvas/quantum-chemistry-map.html":{"title":"Quantum Chemistry Map","icon":"","description":"Computational regimes<br><br><br><br><br><br><br><br><br><br><br><br><br>\n<br>Hohenberg--Kohn theory\n<br>Lieb theory\n<br>Kohn-Sham theory\n<br><br><br>\n<br>Non-variational theory\n<br><br><br><br><br><br><br>\n<br>Lagrange mechanics\n<br>Hamiltonian mechanics\n<br><br>\n<br>Quantum mechanics for many particles\n<br><br><br><br>\n<br>Molecular Schrödinger equation\n<br>Semiclassical EM treatment\n<br><br><br><br><br><br><br>\n<br>Quantum theory of matter-field interactions\n<br>Matter interacting with electromagnetic fields\n<br>Electron spin\n<br><br><br><br>\n<br>Semiclassical theory of nuclei\n<br><br><br><br><br>\n<br>Maxwell's equations\n<br><br>\n<br>Lorenz invariance\n<br><br>","aliases":[],"tags":[],"headers":[{"heading":"Optimization","level":3,"id":"Optimization"},{"heading":"Linear Algebra","level":3,"id":"Linear_Algebra"},{"heading":"Group Theory","level":3,"id":"Group_Theory"},{"heading":"Functional analysis","level":3,"id":"Functional_analysis"},{"heading":"Multilinear Algebra","level":3,"id":"Multilinear_Algebra"},{"heading":"Map of quantum chemistry and mathematics","level":1,"id":"Map_of_quantum_chemistry_and_mathematics"},{"heading":"Ordinary Differential Equations","level":3,"id":"Ordinary_Differential_Equations"},{"heading":"Partial Differential Equations","level":3,"id":"Partial_Differential_Equations"},{"heading":"Functional Analysis","level":3,"id":"Functional_Analysis"},{"heading":"Convex Analysis","level":3,"id":"Convex_Analysis"},{"heading":"Hartree-Fock theory","level":3,"id":"Hartree-Fock_theory"},{"heading":"Density-functional theory","level":3,"id":"Density-functional_theory"},{"heading":"Configuration-Interaction Method","level":3,"id":"Configuration-Interaction_Method"},{"heading":"Coupled-Cluster Theory","level":3,"id":"Coupled-Cluster_Theory"},{"heading":"Many-body Perturbation Theory","level":3,"id":"Many-body_Perturbation_Theory"},{"heading":"Density-Matrix Renormalizaton Group Theory","level":3,"id":"Density-Matrix_Renormalizaton_Group_Theory"},{"heading":"Multiconfiguration Theory","level":3,"id":"Multiconfiguration_Theory"},{"heading":"Green's Function theory","level":3,"id":"Green's_Function_theory"},{"heading":"Group Theory","level":3,"id":"Group_Theory"},{"heading":"Classical mechanics","level":3,"id":"Classical_mechanics"},{"heading":"Many-Body Theory","level":3,"id":"Many-Body_Theory"},{"heading":"Differential Geometry","level":3,"id":"[[Mathematics_Map_Details#Differential_Geometry|Differential_Geometry]]"},{"heading":"Partial Differential Equations","level":3,"id":"Partial_Differential_Equations"},{"heading":"Nonrelativistic Quantum mechanics","level":3,"id":"Nonrelativistic_Quantum_mechanics"},{"heading":"Functional Analysis","level":3,"id":"[[Mathematics_Map_Details#Functional_Analysis|Functional_Analysis]]"},{"heading":"Operator Algebra","level":3,"id":"Operator_Algebra"},{"heading":"Linear Algebra","level":3,"id":"Linear_Algebra"},{"heading":"Group Theory","level":3,"id":"Group_Theory"},{"heading":"Ordinary Differential Equations","level":3,"id":"Ordinary_Differential_Equations"},{"heading":"Quantum electrodynamics","level":3,"id":"Quantum_electrodynamics"},{"heading":"Functional Analysis","level":3,"id":"Functional_Analysis"},{"heading":"Operator Algebra","level":3,"id":"Operator_Algebra"},{"heading":"Born-Oppenheimer Approximation","level":3,"id":"Born-Oppenheimer_Approximation"},{"heading":"Functional Analysis","level":3,"id":"Functional_Analysis"},{"heading":"Linear Algebra","level":3,"id":"Linear_Algebra"},{"heading":"Partial Differential Equations","level":3,"id":"Partial_Differential_Equations"},{"heading":"Classical electromagnetism","level":3,"id":"Classical_electromagnetism"},{"heading":"Special Relativity","level":3,"id":"Special_Relativity"},{"heading":"Partial Differential Equations","level":3,"id":"Partial_Differential_Equations"},{"heading":"Group Theory","level":3,"id":"Group_Theory"}],"backlinks":["mathematics-map-details.html","index.html"],"links":["mathematics-map-details.html#Differential_Geometry","mathematics-map-details.html#Functional_Analysis","canvas/quantum-chemistry-map.html#Optimization","canvas/quantum-chemistry-map.html#Linear_Algebra","canvas/quantum-chemistry-map.html#Group_Theory","canvas/quantum-chemistry-map.html#Functional_analysis","canvas/quantum-chemistry-map.html#Multilinear_Algebra","canvas/quantum-chemistry-map.html#Map_of_quantum_chemistry_and_mathematics","canvas/quantum-chemistry-map.html#Ordinary_Differential_Equations","canvas/quantum-chemistry-map.html#Partial_Differential_Equations","canvas/quantum-chemistry-map.html#Functional_Analysis","canvas/quantum-chemistry-map.html#Convex_Analysis","canvas/quantum-chemistry-map.html#Hartree-Fock_theory","canvas/quantum-chemistry-map.html#Density-functional_theory","canvas/quantum-chemistry-map.html#Configuration-Interaction_Method","canvas/quantum-chemistry-map.html#Coupled-Cluster_Theory","canvas/quantum-chemistry-map.html#Many-body_Perturbation_Theory","canvas/quantum-chemistry-map.html#Density-Matrix_Renormalizaton_Group_Theory","canvas/quantum-chemistry-map.html#Multiconfiguration_Theory","canvas/quantum-chemistry-map.html#Green's_Function_theory","canvas/quantum-chemistry-map.html#Group_Theory","canvas/quantum-chemistry-map.html#Classical_mechanics","canvas/quantum-chemistry-map.html#Many-Body_Theory","canvas/quantum-chemistry-map.html#[[Mathematics_Map_Details#Differential_Geometry|Differential_Geometry]]","canvas/quantum-chemistry-map.html#Partial_Differential_Equations","canvas/quantum-chemistry-map.html#Nonrelativistic_Quantum_mechanics","canvas/quantum-chemistry-map.html#[[Mathematics_Map_Details#Functional_Analysis|Functional_Analysis]]","canvas/quantum-chemistry-map.html#Operator_Algebra","canvas/quantum-chemistry-map.html#Linear_Algebra","canvas/quantum-chemistry-map.html#Group_Theory","canvas/quantum-chemistry-map.html#Ordinary_Differential_Equations","canvas/quantum-chemistry-map.html#Quantum_electrodynamics","canvas/quantum-chemistry-map.html#Functional_Analysis","canvas/quantum-chemistry-map.html#Operator_Algebra","canvas/quantum-chemistry-map.html#Born-Oppenheimer_Approximation","canvas/quantum-chemistry-map.html#Functional_Analysis","canvas/quantum-chemistry-map.html#Linear_Algebra","canvas/quantum-chemistry-map.html#Partial_Differential_Equations","canvas/quantum-chemistry-map.html#Classical_electromagnetism","canvas/quantum-chemistry-map.html#Special_Relativity","canvas/quantum-chemistry-map.html#Partial_Differential_Equations","canvas/quantum-chemistry-map.html#Group_Theory"],"author":"","coverImageURL":"","fullURL":"canvas/quantum-chemistry-map.html","pathToRoot":"..","createdTime":1724744014996,"modifiedTime":1724744014996,"sourceSize":18467,"sourcePath":"Canvas/Quantum Chemistry Map.canvas","exportPath":"canvas/quantum-chemistry-map.html","showInTree":true,"treeOrder":0,"attachments":[]},"index.html":{"title":"index","icon":"","description":"<br>This is the Obsidian vault with material created by Simen Kvaal for the Mathematical Methods lectures at the ESQC 2024 summer school.<br>You may choose files in the view on the right. In the Canvas folder, you find Obsidian Canvases, that graphical visualizations. Select for example <a data-tooltip-position=\"top\" aria-label=\"Mathematics Map.canvas\" data-href=\"Mathematics Map.canvas\" href=\"/canvas/mathematics-map.html\" class=\"internal-link\" target=\"_self\" rel=\"noopener\">Mathematics Map</a> to go to the map of mathematics for quantum chemistry, and select <a data-tooltip-position=\"top\" aria-label=\"Quantum Chemistry Map.canvas\" data-href=\"Quantum Chemistry Map.canvas\" href=\"/canvas/quantum-chemistry-map.html\" class=\"internal-link\" target=\"_self\" rel=\"noopener\">Quantum Chemistry Map</a> to look at how mathematical topics relate to various quantum chemistry topics.<br>To read the description of the Mathematics Map, please read <a data-href=\"Mathematics Map Details\" href=\"/mathematics-map-details.html\" class=\"internal-link\" target=\"_self\" rel=\"noopener\">Mathematics Map Details</a>, which is also available directly from the canvas.<br>See <a data-href=\"Recommended General Mathematics Reading\" href=\"/recommended-general-mathematics-reading.html\" class=\"internal-link\" target=\"_self\" rel=\"noopener\">Recommended General Mathematics Reading</a> for some general reading recommendations.<br>See <a data-href=\"Recommended YouTube channels\" href=\"/recommended-youtube-channels.html\" class=\"internal-link\" target=\"_self\" rel=\"noopener\">Recommended YouTube channels</a> for some recommended YouTube channels.","aliases":[],"tags":[],"headers":[{"heading":"index","level":1,"id":"index"}],"backlinks":[],"links":["canvas/mathematics-map.html","canvas/quantum-chemistry-map.html","mathematics-map-details.html","recommended-general-mathematics-reading.html","recommended-youtube-channels.html","index.html#index"],"author":"","coverImageURL":"","fullURL":"index.html","pathToRoot":"","createdTime":1724744015026,"modifiedTime":1724745101167,"sourceSize":839,"sourcePath":"index.md","exportPath":"index.html","showInTree":true,"treeOrder":0,"attachments":[]},"mathematics-map-details.html":{"title":"A mathematical roadmap for quantum chemistry","icon":"","description":"<a class=\"tag\" href=\"?query=tag:esqc\" style=\"background-color: rgb(4, 108, 116); color: white; font-weight: 700; border: none; border-radius: 1em; padding: 0.2em 0.5em;\">#esqc</a> <br> <a href=\".?query=tag:esqc\" class=\"tag is-unresolved\" target=\"_self\" rel=\"noopener\" data-href=\"#esqc\">#esqc</a><br>We here (link to map: <a data-tooltip-position=\"top\" aria-label=\"Mathematics Map.canvas\" data-href=\"Mathematics Map.canvas\" href=\"/canvas/mathematics-map.html\" class=\"internal-link\" target=\"_self\" rel=\"noopener\">Mathematics Map</a>) try to outline, graphically, a set of mathematical topics, and how they are relevant for the study of quantum chemistry. The subdivision of mathematical topics is largely artificial and biased as there there is no rigorous way to do such a thing. <br>Each box contains one field, or topic, and they are connected to other boxes with the arrow indicating the direction from \"more general\" to \"less general and more special\".<br>In a second visualization (<a data-tooltip-position=\"top\" aria-label=\"Quantum Chemistry Map.canvas\" data-href=\"Quantum Chemistry Map.canvas\" href=\"/canvas/quantum-chemistry-map.html\" class=\"internal-link\" target=\"_self\" rel=\"noopener\">link to canvas</a>) we try to organize the various topics of theoretical and quantum chemistry in relation to the mathematical map.<br>Of course, many more arrows could be drawn, and many more boxes could be added. In order to make the graph not too cluttered and confusing, we keep only main links.<br>NOTE: Topics marked with a are considered of prime importance to any quantum chemist, regardless of their specialization.<br>Logic is the branch of mathematics and philosophy that deals with reasoning, the principles of valid inference, and the structure of propositions, i.e., mathematical statements. It provides the formal framework used to analyze and construct mathematical proofs, ensuring that conclusions follow from premises in a valid and systematic way.<br>Set theory is the branch of mathematics that studies sets, which are collections of objects. In set theory, everything is a set. It forms the foundation for much (all?) of modern mathematics, providing the language and basic concepts used to describe and analyze mathematical structures. Set theory forms the foundation in the sense that every other mathematical theory can be formalized in the language of set theory.<br>Most mathematicians are aware of formal set theory, but the \"version\" used in most contexts is \"naive set theory\", which in a more informal manner defines mathematical sets compared to the rigorous axiom based constructions. As Russel's Paradox shows us, naive set theory has some pitfalls. Most mathematicians simply avoid these pitfalls and stick to naive set theory.<br>Although formal set theory is unlikely to be applied in the study of quantum chemistry, the basic notation is widely-used and an important language tool when specifying computational methods and their implementation. <br>Recommended reading:<br>\"Set Theory for the Working Mathematician\" by - Krzysztof Ciesielski, Cambridge University Press (1997) <a rel=\"noopener\" class=\"external-link is-unresolved\" href=\"https://doi.org/10.1017/CBO9781139173131\" target=\"_self\">https://doi.org/10.1017/CBO9781139173131</a>\n<br>Category theory is a branch of mathematics that provides a high-level, abstract framework for describing and analyzing mathematical structures and their relationships. It was developed in the 1940s by Samuel Eilenberg and Saunders Mac Lane, and has found applications across nearly all areas of mathematics, as well as in computer science, logic, and theoretical physics.<br>One of the useful aspects of category theory is that it gives a rigorous language for comparing different mathematical concepts and structures, such as groups and vector spaces.<br>Although direct use of category theory in quantum chemistry is rare, it is mentioned here as an important branch of modern mathematics.<br>Recommended reading:<br>...\n<br>In abstract algebra, sets are given mathematical structure in the form of binary operations and various axioms that define what it is to be, e.g., a group. Thus, a group is defined in terms of its essential features, and not its concrete realizations. For example, the group with group operation of addition modulo 4, compared to the matrix group consisting of powers of the matrix .<br>Important algebraic constructions include groups, semigroups, rings, modules, vector spaces, and algebras.<br>Abstract algebra is important for quantum chemistry, since it lays the foundation for linear algebra, one of the most important tools of the scientist, and the study of molecular symmetries and groups.<br>Recommended reading:<br>...\n<br>Group theory is the study of abstract groups and their representations. Lie groups are groups that are also differentiable manifolds (see Differential Geometry). Group theory permeates theoretical physics and chemistry, giving an axiomatic treatment of symmetry. Representation theory studies groups represented as linear operators or matrices acting on vector spaces.<br>In chemistry, molecular symmetries and point groups are useful for understanding molecular behavior and also eases interpretation of spectroscopic experiments. Spectroscopic notation is a consequence of conservation of angular momentum. Representation theory is applied to explain the symmetries of molecular orbitals. Having a grasp of group theory is absolutely essential for the quantum chemist.<br>Recommended reading:<br>... <br>The axiomatic definition of the natural numbers using set theory is one of the simplest examples of how set theory serves as foundation for mathematics. The natural numbers are again used to define the integers, rational numbers, real numbers, and complex numbers. These sets are of course among the most important mathematical objects in the sciences. The number systems are again examples of algebraic structures: the integers form a group under addition, the real and complex numbers form fields.<br>Clearly, understanding numbers is essential to any scientific study. On the other hand, for most purposes, intuitive notions about integers, reals, and complex numbers will be sufficient.<br>Recommended reading:<br> <br>Topology is the study of open and closed sets, and the concept of continuity. A topological space is a set together with a collection of subsets called open subsets, and axioms that these have to obey. From this, topological spaces are generated, allowing us to talk about \"closeness\" of elements in the set. For example, a metric is an example of a structure that gives rise to a particular kind of topology, that formalizes the notion of distance between points.<br>In topology the notion of sequences and their convergence is made abstract, including the notion of continuous functions. Topological arguments are indispensable for mathematical analysis of partial differential equations.<br>For quantum chemists, being aware of the various notions of topology is useful to navigate the literature. For example, the convergence of the pseudocontinuum of the FCI method can be formalized with topological notions. As another example, in density-functional theory, what does it mean that two electronic densities are close together? Being able to distinguish different notions of \"closeness of densities\" is imperative for understanding, say, modes of convergence of SCF iterations.<br>Recommended reading:<br>...\n<br>Measure theory develops abstract notions of length, area, volume, etc., and allows to speak about such notions in potentially very abstract spaces. For example, the Dirac delta function is rigorously defined using measure theory. <br>The Lebesgue integral is based on the notion of a Borel measure, and generalizes the Riemann integral. With the Lebesgue integral we can integrate many more functions compared to the Riemann integral, and operations like exchanging limits and integrals or integration variables obey well-defined and simple theorems. The Lebesgue integral is also necessary to define the Hilbert space of quantum mechanics. <br>A passing knowledge if measure theory is very useful for the quantum chemist, since much of the language used in mathematical physics relies on these concepts. That being said, detailed theorems are rarely used, except in borderline cases, where apparent paradoxes may arise. In those cases, these paradoxes are resolved by checking the conditions for, say, interchange of limits and integration.<br>Recommended reading:<br>...\n<br>With distribution theory one extends the concept of functions to include objects, known as distributions or generalized functions, which can be used to rigorously define operations like differentiation even for functions that are not classically differentiable. This theory is particularly useful in handling singularities or discontinuities, such as the Dirac delta function, which models an infinitely concentrated point of mass or charge. Distribution theory provides a powerful framework for solving partial differential equations, e.g., using Green's functions.<br>A rudimentary knowledge of distribution theory is very useful in the study of quantum mechanics. The standard informal view is that \"the Dirac delta is a function which is infinite everywhere except at a single point where it is infinity\", similarly that \"the Green's function is the response of the system to a Dirac delta function\", is very useful, but will only take one so far.<br>Useful in (for example):<br>Response theory\n<br>Manybody Green's function theory\n<br>Electromagnetism\n<br>Recommended reading:<br>...\n<br>In linear algebra, one studies linear vector spaces and linear functions between such spaces. Typical, and indeed archetypal, examples are and , and matrices with complex or real entries. It is no exaggeration that linear algebra is perhaps the most important tool in science, being at the heart of everything from quantum mechanics, data analysis, and numerical methods for the solution of partial differential equations.<br>Having a good command of linear algebra is absolutely essential to any theoretical chemist, from the LCAO approach to molecular orbitals, via practical realizations of Kohn--Sham density functional theory, to the numerical solution of, say, the coupled-cluster method.<br>Recommended reading:<br> \"Linear Algebra Done Right\" by Sheldon Axler\n<img alt=\"Linear Algebra Done Right.png\" src=\"/attachments/linear-algebra-done-right.png\" style=\"width: 300px; max-width: 100%;\" target=\"_self\">\nA highly regarded undergraduate text in linear algebra, considered a very fine piece of didacic writing. Open access. Available for free on the Author's web page: <a rel=\"noopener\" class=\"external-link is-unresolved\" href=\"https://linear.axler.net/\" target=\"_self\">https://linear.axler.net/</a>\n<br>In multilinear algebra, linear maps between vector spaces are generalized to maps over several vector spaces to several vector spaces at once, i.e., tensors. Multilinear algebra is rarely taught together with linear algebra, but could well be a subtopic in an advanced course, especially considering it is an important part of modern machine learning methodology. Multilinear algebra finds important use cases in differential geometry, as well as appearing naturally in calculus of several variables. Tensors are also integral to manybody methods like coupled-cluster theory or configuration-interaction theort.<br>Multilinear algebra is among the more useful topics for quantum chemists.<br>Recommended reading:<br>...\n<br>Calculus is the branch of mathematics that studies continuous change and is divided into two main areas: differential calculus and integral calculus. Differential calculus focuses on the concept of the derivative, rates of change. Integral calculus, on the other hand, deals with the concept of the integral.<br>Multivariate calculus extends to functions of several variables, encompassing the study of partial derivatives, multiple integrals, and vector calculus. <br>Calculus, together with linear algebra, forms the foundation for much of modern science. It is absolutely essential to have a good grasp of calculus and multivariate calculus for theoretical chemists.<br>Recommended reading:<br>...\n<br>Complex analysis studies the calculus of functions of complex variables. For complex functions, being differentiable is a much more restricting requirement than for real functions, leading to surprising and very strong results of great use in physics and chemistry. Since real functions often are special cases of complex functions, complex analysis is very useful even if complex numbers do not show up at all in a theory.<br>Useful in: Response theory, quantum dynamics, integral evaluation, perturbation theory, to name a few.<br>Complex analysis is among the more useful topics for quantum chemists.<br>Recommended reading:<br>....\n<br>Differential geometry studies curves, surfaces, and higher-dimensional analogues from an abstract perspective, called differentiable manifolds. These are characterized by the fact that they somehow are smooth, and that locally, i.e., in for sufficiently small neighborhoods of points (if one zooms in on any point), they look like flat space, i.e., (or for complex manifolds). Thus, differential geometry combines multivariate calculus and linear algebra. One has infinite dimensional versions of the theory, as well, where the modelling spaces are infinite dimensional Banach or Hilbert spaces.<br>Differential geometry is very useful for abstract understanding of manybody wavefunction methods. For example, the concept of orbital invariance in CASSCF, or the manifold structure of the Hartree-Fock or coupled-cluster methods. See also lie group theory.<br>Differential geometry is also the foundation for general relativity, and, to a lesser extent, special relativity.<br>Differential geometry is among the more useful branches of mathematics for quantum chemistry students.<br>Recommended reading:<br>...\n<br>Convex analysis deals with convex sets and functions. It is an important branch of mathematics, since many optimization problems in science enjoy the property of convexity. Convex analysis introduces a duality transformation, the Legendre-Fenchel transformation, which in many ways are analogous to the Fourier transform.<br>Convex analysis plays a prominent role in the mathematical foundation of DFT, as pioneered by E.H. Lieb. The Legendre-Fenchel transformation is also important in thermodynamics.<br>Convex analysis is a useful topic, especially if one wants to study DFT.<br>Recommended reading:<br>...\n<br>Functional analysis can be viewed as infinite dimensional linear algebra. Here, complete normed spaces (Banach spaces) and complete inner product spaces (Hilbert spaces) are studied, along with linear operators between such spaces. Functional analysis is the foundation of quantum mechanics, as done by J. von Neumann. In a way, one can say that the development of functional analysis in the early 20th century was motivated by placing quantum mechanics on rigorous ground.<br>Functional analysis also provides the mathematical language for abstract treatment of PDEs such as the Schrödinger equation, the Kohn--Sham approach to DFT, Maxwell's equations, and so on.<br>Functional analysis is a very useful topic for quantum chemists, especially when you want to navigate the more mathematics heavy literature.<br>Recommended reading:<br>...\n<br>Calculus of variations deals with the optimization of nonlinear functionals, functions that map functions to scalars. Calculus of variations generalizes vector calculus to infinite dimensions, and as such could also be called \"nonlinear functional analysis\". Calculus of variations is the correct framework for variational formulations of the laws of nature, from quantum field theory and QED to Hamilton's equations of motion. Moreover, nonlinear approximations to the molecular Schrödinger equation such as Hartree-Fock is naturally formulated in this language.<br>To have a basic grasp of calculus of variations is almost essential to quantum chemists. A basic knowledge does not require advanced functional analysis, even if the above paragraph gives such an expression.<br>Calculus of variations is thus an exceedingly important topic in quantum chemistry.<br>Recommended reading:<br>Goldstein, Safko and Poole, \"Classical Mechanics\"\n<br>Zeidler, \"Nonlinear functional analysis\"\n<br>...\n<br>Ordinary differential equations (ODEs) describe initial value and boundary value problems of scalar quantities, or coupled such equations. From classical mechanics to rate equations, ODEs permeate theoretical chemistry, and having a basic understanding of essential mathematical results is absolutely essential.<br>Recommended reading:<br>...\n<br>Partial differential equations (PDEs) generalize ODEs to infinite dimensions, i.e., initial and boundary value problems where the unknown is no longer a scalar or a vector, but an element in a function space. Laws such as Einstein's gravitation theory, transport of heat, chemical reaction-diffusion systems, Maxwell's equations, the various Schrödinger equations, are all PDEs.<br>PDEs are very important for quantum chemistry.<br>Recommended reading:<br>...\n<br>...\n<br>In operator algebra, one studies algebras of operators over linear spaces, often Hilbert spaces. The algebras are often given structures inspired by quantum mechanics, such as canonical anticommutator or canonical commutator relations, e.g. the CAR and CCR algebras. It is a highly abstract branch of pure mathematics, and understanding the basic notions and results may be very useful for the study of manybody theory and quantum field theories.<br>Recommended reading:<br>...\n<br>...\n<br>Most equations in quantum chemistry cannot be solved analytically, and must be approximated in finite precision arithmetic on computers. This is the area of numerical analysis. Here, numerical methods for differential equations are studied, as well as numerical linear algebra and eigenvalue finding algorithms, to name some topics.<br>Numerical analysis is very important for developing and understanding computer implementations of quantum chemistry algorithms.<br>Recommended reading:<br>...\n<br>Optimization, really a subfield of numerical analysis, deals with finding local or global extremal points of functions of several variables, as well as finding roots of systems of nonlinear equations. There are a multitude of algorithms, such as the method of steepest descent, Newton, and quasi-Newton methods. A very important topic for students of quantum chemistry, as many computational problems end up as an optimization problem.<br>Recommended reading:<br>...\n<br>","aliases":[],"tags":["#esqc"],"headers":[{"heading":"A mathematical roadmap for quantum chemistry","level":1,"id":"A mathematical roadmap for quantum chemistry"},{"heading":"Logic and Set Theory","level":2,"id":"Logic_and_Set_Theory"},{"heading":"Category Theory","level":2,"id":"Category_Theory"},{"heading":"Abstract Algebra","level":2,"id":"Abstract_Algebra"},{"heading":" Group Theory","level":2,"id":"$\\heartsuit$_Group_Theory"},{"heading":"Number systems","level":2,"id":"Number_systems"},{"heading":"Topology","level":2,"id":"Topology"},{"heading":"Measure and integration","level":2,"id":"Measure_and_integration"},{"heading":"Distribution theory","level":2,"id":"Distribution_theory"},{"heading":" Linear Algebra","level":2,"id":"$\\heartsuit$_Linear_Algebra"},{"heading":"Multilinear algebra","level":2,"id":"Multilinear_algebra"},{"heading":" Calculus","level":2,"id":"$\\heartsuit$_Calculus"},{"heading":"Complex analysis","level":2,"id":"Complex_analysis"},{"heading":"Differential Geometry","level":2,"id":"Differential_Geometry"},{"heading":"Convex Analysis","level":2,"id":"Convex_Analysis"},{"heading":"Functional Analysis","level":2,"id":"Functional_Analysis"},{"heading":"Calculus of Variations","level":2,"id":"Calculus_of_Variations"},{"heading":" Ordinary differential equations","level":2,"id":"$\\heartsuit$_Ordinary_differential_equations"},{"heading":"Partial differential equations","level":2,"id":"Partial_differential_equations"},{"heading":"Operator algebra","level":2,"id":"Operator_algebra"},{"heading":"Numerical analysis","level":2,"id":"Numerical_analysis"},{"heading":"Optimization and root finding","level":2,"id":"Optimization_and_root_finding"}],"backlinks":["index.html"],"links":["?query=tag:esqc","canvas/mathematics-map.html","canvas/quantum-chemistry-map.html","https://doi.org/10.1017/CBO9781139173131","https://linear.axler.net/","mathematics-map-details.html#A mathematical roadmap for quantum chemistry","mathematics-map-details.html#Logic_and_Set_Theory","mathematics-map-details.html#Category_Theory","mathematics-map-details.html#Abstract_Algebra","mathematics-map-details.html#$\\heartsuit$_Group_Theory","mathematics-map-details.html#Number_systems","mathematics-map-details.html#Topology","mathematics-map-details.html#Measure_and_integration","mathematics-map-details.html#Distribution_theory","mathematics-map-details.html#$\\heartsuit$_Linear_Algebra","mathematics-map-details.html#Multilinear_algebra","mathematics-map-details.html#$\\heartsuit$_Calculus","mathematics-map-details.html#Complex_analysis","mathematics-map-details.html#Differential_Geometry","mathematics-map-details.html#Convex_Analysis","mathematics-map-details.html#Functional_Analysis","mathematics-map-details.html#Calculus_of_Variations","mathematics-map-details.html#$\\heartsuit$_Ordinary_differential_equations","mathematics-map-details.html#Partial_differential_equations","mathematics-map-details.html#Operator_algebra","mathematics-map-details.html#Numerical_analysis","mathematics-map-details.html#Optimization_and_root_finding"],"author":"","coverImageURL":"","fullURL":"mathematics-map-details.html","pathToRoot":"","createdTime":1724744014996,"modifiedTime":1724745066634,"sourceSize":18395,"sourcePath":"Mathematics Map Details.md","exportPath":"mathematics-map-details.html","showInTree":true,"treeOrder":0,"attachments":["attachments/linear-algebra-done-right.png"]},"recommended-general-mathematics-reading.html":{"title":"Recommended General Mathematics Reading","icon":"","description":"<br>Here are some suggestions for general mathematical physics and chemistry.<br><br>Book: \"Mathematical Physics\" by Eugene Butkov, Addison-Wesley Publishing Company (1968)<br><img alt=\"Butkov.png\" src=\"/attachments/butkov.png\" style=\"width: 300px; max-width: 100%;\" target=\"_self\"><br>\nThis is a classic textbook used in mathematical physics courses since its first edition in 1968. You can find <a data-tooltip-position=\"top\" aria-label=\"https://edisciplinas.usp.br/pluginfile.php/7270234/mod_folder/content/0/Mathematical%20Physics%20-%20Butkov.pdf\" rel=\"noopener\" class=\"external-link is-unresolved\" href=\"https://edisciplinas.usp.br/pluginfile.php/7270234/mod_folder/content/0/Mathematical%20Physics%20-%20Butkov.pdf\" target=\"_self\">PDFs lying about on the internet</a>. The book is suitable for all students of quantum chemistry, from undergraduate to graduate students.<br>The topics covered include:<br>\n<br>Vector calculus\n<br>\n<br>Complex analysis\n<br>Ordinary differential equations\n<br>Distributions\n<br>Fourier series and the Fourier transform\n<br>The Laplace transform\n<br>Hilbert space and the postulates of Quantum Mechanics\n<br>Perturbation theory\n<br>Tensors\n<br>Calculus of Variations\n<br><br>Book: \"Mathematical Methods for Physicsts: A Comprehensive Guide\" by George B. Arfken, Hans J. Weber, and Frank E. Harris, 7th edition, Academic Press (2013)<br><img alt=\"Arfken.png\" src=\"/attachments/arfken.png\" style=\"width: 300px; max-width: 100%;\" target=\"_self\"><br>Weblink: <a rel=\"noopener\" class=\"external-link is-unresolved\" href=\"https://www.sciencedirect.com/book/9780123846549/mathematical-methods-for-physicists\" target=\"_self\">https://www.sciencedirect.com/book/9780123846549/mathematical-methods-for-physicists</a><br>\nArchived version: <a rel=\"noopener\" class=\"external-link is-unresolved\" href=\"https://archive.org/details/Mathematical_Methods_for_Physicists\" target=\"_self\">https://archive.org/details/Mathematical_Methods_for_Physicists</a><br>Another classic, the tome by Arfken, Weber, and Harris is a standard textbook in mathematical physics for undergraduate and graduate students in physics. Luckily, it is archived on archive.org, see link above. It is highly recommended, and contains treatments of, for example:<br>\n<br>Complex analysis\n<br>Vector calculus\n<br>Tensor analysis and differential forms\n<br>Partial differential equations\n<br>Green's functions\n<br>Angular momentum\n<br>Various special functions\n<br>Integral transforms\n<br>Probability and statistics\n<br><br>Book: \"Mathematical Methods in Physics\" by Philippe Blanchard and Erwin Brüning, Second edition, Birkhäuser (2015)<br>DOI: 10.1007/978-3-319-14045-2<br><img alt=\"Blanchard and Bruening.png\" src=\"/attachments/blanchard-and-bruening.png\" style=\"width: 300px; max-width: 100%;\" target=\"_self\"><br>\nThis is a textbook intended for graduate students in mathematics and physics. Its level is higher and in some respects more modern than the book by <a data-tooltip-position=\"top\" aria-label=\"&quot;Mathematical Physics&quot; by Butkov\" data-href=\"#&quot;Mathematical Physics&quot; by Butkov\" href=\"/recommended-general-mathematics-reading.html#&quot;Mathematical_Physics&quot;_by_Butkov\" class=\"internal-link\" target=\"_self\" rel=\"noopener\">Butkov</a>. The topics covered include:<br>\n<br>Locally convex topological vector spaces and distribution theory\n<br>Complex analysis of several variables\n<br>Fourier transformations\n<br>Sobolev spaces\n<br>Advanced aspects of Hilbert spaces\n<br>Linear operators and advanced spectral theory, also for unbounded operators\n<br>Rigged Hilbert space\n<br>Operator algebras, e.g., C*-algebra\n<br>Calculus of variations\n<br>Boundary value problems and eigenvalue problems\n<br>Density functional theory of atoms and molecules\n<br><br>Book: \"Mathematical Concepts of Quantum Mechanics\" by Stephen J. Gustaffson, and Israel Michael Sigal, Second Edition, Springer (2011).<br><img alt=\"Gustafson and Sigal.png\" src=\"/attachments/gustafson-and-sigal.png\" style=\"width: 300px; max-width: 100%;\" target=\"_self\"><br>\nWeblink: <a rel=\"noopener\" class=\"external-link is-unresolved\" href=\"https://link.springer.com/book/10.1007/978-3-030-59562-3\" target=\"_self\">https://link.springer.com/book/10.1007/978-3-030-59562-3</a><br>An old PDF from Sigal's web site: <a rel=\"noopener\" class=\"external-link is-unresolved\" href=\"https://www.math.toronto.edu/~sigal/semlectnotes/1.pdf\" target=\"_self\">https://www.math.toronto.edu/~sigal/semlectnotes/1.pdf</a><br>This book is essentially a set of lecture notes given for physics and mathematics students at late undergraduate or early graduate stages of their studies. It is a well-structured book on what the title says. I use it quite a lot, as it contains many useful results. The topics include:<br>\n<br>Analysis of atomic and molecular quantum systems\n<br>Treatments of basic quantum mechanical systems using a little more rigor than usual\n<br>Many-particle theory\n<br>Perturbation theory\n<br>Theorems on spectra of many-particle operators\n<br>Resonances\n<br>Path-integral formalism of Feynman\n<br>Second quantization\n<br><br>Book: \"Mathematical Methods in Quantum Mechanics: With Applications<br>\nto Schrödinger Operators\" by Gerald Teschl, Seccond ed., American Mathematical Society (2014).<br>Web link: <a rel=\"noopener\" class=\"external-link is-unresolved\" href=\"https://bookstore.ams.org/gsm-157\" target=\"_self\">https://bookstore.ams.org/gsm-157</a><br>Full text PDF at the Author's web site: <a rel=\"noopener\" class=\"external-link is-unresolved\" href=\"https://www.mat.univie.ac.at/~gerald/ftp/book-schroe/index.html\" target=\"_self\">https://www.mat.univie.ac.at/~gerald/ftp/book-schroe/index.html</a><br><img alt=\"Teschl.png\" src=\"/attachments/teschl.png\" style=\"width: 300px; max-width: 100%;\" target=\"_self\"><br>\nThis is a modern classic in mathematical physics, its primary goal is the rigorous treatment of nonrelativistic quantum mechanics. Topics include:<br>\n<br>Hilbert and Banach spaces\n<br>The Spectral theorem for unbounded self-adjoint operators\n<br>Quantum dynamics and the Stone-von-Neumann theorem\n<br>Perturbation theory\n<br>Schrödinger operators, i.e., the description of atomic systems\n<br>Scattering theory <br>Lebesgue integration\n<br><br>Book series: \"Methods of modern mathematical physics\", by Michael Reed and Barry Simon, Academic Press (1980)<br>Weblink: <a rel=\"noopener\" class=\"external-link is-unresolved\" href=\"https://www.sciencedirect.com/book/9780125850018/methods-of-modern-mathematical-physics\" target=\"_self\">https://www.sciencedirect.com/book/9780125850018/methods-of-modern-mathematical-physics</a><br>There are some links to the full text in the wild:<br>\n<a rel=\"noopener\" class=\"external-link is-unresolved\" href=\"https://www.astrosen.unam.mx/~aceves/Metodos/ebooks/reed_simon1.pdf\" target=\"_self\">https://www.astrosen.unam.mx/~aceves/Metodos/ebooks/reed_simon1.pdf</a><br>A comprehensive book series with advanced treatments of, well, the methods of mathematical physics. The volumes are:<br><br>This is the volume I am personally acquainted with. Some topics covered are:<br>\n<br>Measure and integration\n<br>Hilbert space\n<br>Locally convex topological vector spaces\n<br>Bounded and unbounded operators\n<br>The spectral theorem\n<br><br><br><br><br>In this sections you can find some sources I have found online that may be useful. However, I have not checked their quality, and your mileage might vary:<br><br><img alt=\"Mathematical Physical Chemistry.png\" src=\"/attachments/mathematical-physical-chemistry.png\" style=\"width: 300px; max-width: 100%;\" target=\"_self\"><br>Book: \"Mathematical Physical Chemistry: Practical and Intuitive Methodology\" by Shu Hotta, Third Edition, Springer (2023)<br>Weblink: <a rel=\"noopener\" class=\"external-link is-unresolved\" href=\"https://link.springer.com/book/10.1007/978-981-99-2512-4\" target=\"_self\">https://link.springer.com/book/10.1007/978-981-99-2512-4</a><br>This book is somewhat odd - it is not a mathematics book, for that it is not sufficiently rigorous, and neither is it a physical chemistry textbook. However, it goes through the classical selection of physical chemistry topics in a more mathematical manner, providing detailed derivations along the way. It reads like your usual typed-up lecture notes from a theory-heavy physical chemistry curse. It seems like an excellent companion to studies in physical chemistry, and in particular a very good way for students to learn and understand the mathematical concepts needed for quantum chemistry.","aliases":[],"tags":[],"headers":[{"heading":"Recommended General Mathematics Reading","level":1,"id":"Recommended General Mathematics Reading"},{"heading":"\"Mathematical Physics\" by Butkov","level":2,"id":"\"Mathematical_Physics\"_by_Butkov"},{"heading":"\"Mathematical Methods for Physicists\" by Arfken, Weber, and Harris","level":2,"id":"\"Mathematical_Methods_for_Physicists\"_by_Arfken,_Weber,_and_Harris"},{"heading":"\"Mathematical Methods in Physics\" by Blanchard and Brüning","level":2,"id":"\"Mathematical_Methods_in_Physics\"_by_Blanchard_and_Brüning"},{"heading":"\"Mathematical Concepts of Quantum Mechanics\" by Gustafsson and Sigal","level":2,"id":"\"Mathematical_Concepts_of_Quantum_Mechanics\"_by_Gustafsson_and_Sigal"},{"heading":"\"Mathematical Methods in Quantum Mechanics\" by Teschl","level":2,"id":"\"Mathematical_Methods_in_Quantum_Mechanics\"_by_Teschl"},{"heading":"\"Methods of Modern Mathematical Physics\" by Reed and Simon","level":2,"id":"\"Methods_of_Modern_Mathematical_Physics\"_by_Reed_and_Simon"},{"heading":"I: Functional Analysis","level":3,"id":"I_Functional_Analysis"},{"heading":"II: Fourier Analysis and Self-Adjointness","level":3,"id":"II_Fourier_Analysis_and_Self-Adjointness"},{"heading":"III: Scattering Theory","level":3,"id":"III_Scattering_Theory"},{"heading":"IV: Analysis of Operators","level":3,"id":"IV_Analysis_of_Operators"},{"heading":"Untested sources","level":1,"id":"Untested_sources"},{"heading":"\"Mathematical Physical Chemistry\" by Hotta","level":2,"id":"\"Mathematical_Physical_Chemistry\"_by_Hotta"}],"backlinks":["recommended-general-mathematics-reading.html","index.html"],"links":["https://edisciplinas.usp.br/pluginfile.php/7270234/mod_folder/content/0/Mathematical%20Physics%20-%20Butkov.pdf","https://www.sciencedirect.com/book/9780123846549/mathematical-methods-for-physicists","https://archive.org/details/Mathematical_Methods_for_Physicists","recommended-general-mathematics-reading.html#\"Mathematical_Physics\"_by_Butkov","https://link.springer.com/book/10.1007/978-3-030-59562-3","https://www.math.toronto.edu/~sigal/semlectnotes/1.pdf","https://bookstore.ams.org/gsm-157","https://www.mat.univie.ac.at/~gerald/ftp/book-schroe/index.html","https://www.sciencedirect.com/book/9780125850018/methods-of-modern-mathematical-physics","https://www.astrosen.unam.mx/~aceves/Metodos/ebooks/reed_simon1.pdf","https://link.springer.com/book/10.1007/978-981-99-2512-4","recommended-general-mathematics-reading.html#Recommended General Mathematics Reading","recommended-general-mathematics-reading.html#\"Mathematical_Physics\"_by_Butkov","recommended-general-mathematics-reading.html#\"Mathematical_Methods_for_Physicists\"_by_Arfken,_Weber,_and_Harris","recommended-general-mathematics-reading.html#\"Mathematical_Methods_in_Physics\"_by_Blanchard_and_Brüning","recommended-general-mathematics-reading.html#\"Mathematical_Concepts_of_Quantum_Mechanics\"_by_Gustafsson_and_Sigal","recommended-general-mathematics-reading.html#\"Mathematical_Methods_in_Quantum_Mechanics\"_by_Teschl","recommended-general-mathematics-reading.html#\"Methods_of_Modern_Mathematical_Physics\"_by_Reed_and_Simon","recommended-general-mathematics-reading.html#I_Functional_Analysis","recommended-general-mathematics-reading.html#II_Fourier_Analysis_and_Self-Adjointness","recommended-general-mathematics-reading.html#III_Scattering_Theory","recommended-general-mathematics-reading.html#IV_Analysis_of_Operators","recommended-general-mathematics-reading.html#Untested_sources","recommended-general-mathematics-reading.html#\"Mathematical_Physical_Chemistry\"_by_Hotta"],"author":"","coverImageURL":"","fullURL":"recommended-general-mathematics-reading.html","pathToRoot":"","createdTime":1724744015008,"modifiedTime":1724745239434,"sourceSize":6477,"sourcePath":"Recommended General Mathematics Reading.md","exportPath":"recommended-general-mathematics-reading.html","showInTree":true,"treeOrder":0,"attachments":["attachments/butkov.png","attachments/arfken.png","attachments/blanchard-and-bruening.png","attachments/gustafson-and-sigal.png","attachments/teschl.png","attachments/mathematical-physical-chemistry.png"]},"recommended-youtube-channels.html":{"title":"Recommended YouTube channels","icon":"","description":"<br><br>Link: <a rel=\"noopener\" class=\"external-link is-unresolved\" href=\"https://www.youtube.com/@brightsideofmaths\" target=\"_self\">https://www.youtube.com/@brightsideofmaths</a><br>A brilliant series of mathematically rigorous lectures on various mathematical topics, made by <a data-tooltip-position=\"top\" aria-label=\"https://jp-g.de\" rel=\"noopener\" class=\"external-link is-unresolved\" href=\"https://jp-g.de\" target=\"_self\">Dr. Julian P. Grossmann</a> In a calm voice and using minimalistic digital white board style presentations, he presents advanced mathematical topics in a pedagogical and systematic manner.<br><img alt=\"TouTube Bright Side of Mathematics.png\" src=\"/attachments/toutube-bright-side-of-mathematics.png\" target=\"_self\"><br>Example playlists:<br>\n<br><a data-tooltip-position=\"top\" aria-label=\"https://www.youtube.com/watch?v=Ob_S-w54f14&amp;list=PLBh2i93oe2quqtKOibchMxIbuLY41RmJa\" rel=\"noopener\" class=\"external-link is-unresolved\" href=\"https://www.youtube.com/watch?v=Ob_S-w54f14&amp;list=PLBh2i93oe2quqtKOibchMxIbuLY41RmJa\" target=\"_self\">How to learn maths</a>\n<br><a data-tooltip-position=\"top\" aria-label=\"https://www.youtube.com/watch?v=4QhZTagNq9Q&amp;list=PLBh2i93oe2qv4G2AyarkbR3OKBml0hXEg\" rel=\"noopener\" class=\"external-link is-unresolved\" href=\"https://www.youtube.com/watch?v=4QhZTagNq9Q&amp;list=PLBh2i93oe2qv4G2AyarkbR3OKBml0hXEg\" target=\"_self\">Multivariable calculus</a>\n<br><a data-tooltip-position=\"top\" aria-label=\"https://www.youtube.com/watch?v=pOD5oKpBP-c&amp;list=PLBh2i93oe2qtAFfLUm_dAVcTf3N9McK0U\" rel=\"noopener\" class=\"external-link is-unresolved\" href=\"https://www.youtube.com/watch?v=pOD5oKpBP-c&amp;list=PLBh2i93oe2qtAFfLUm_dAVcTf3N9McK0U\" target=\"_self\">Ordinary Differential Equations</a>\n<br><a data-tooltip-position=\"top\" aria-label=\"https://www.youtube.com/watch?v=yDdxFBcvSGw&amp;list=PLBh2i93oe2qsGKDOsuVVw-OCAfprrnGfr\" rel=\"noopener\" class=\"external-link is-unresolved\" href=\"https://www.youtube.com/watch?v=yDdxFBcvSGw&amp;list=PLBh2i93oe2qsGKDOsuVVw-OCAfprrnGfr\" target=\"_self\">Functional analysis</a>\n<br><br>Michael Penn is Professor of Mathematics at Randolph College in Virginia.<br>From his channel, \"Math videos covering a wide variety of topics from theory to application. Calculus, Differential Equations, Number Theory, Proofs, unique problems and much more.\"<br>His videos are entertaining and avoid all the flash and glam associated with modern YouTube content. <br>Link: <a rel=\"noopener\" class=\"external-link is-unresolved\" href=\"https://www.youtube.com/@MichaelPennMath\" target=\"_self\">https://www.youtube.com/@MichaelPennMath</a><br>He also has a second channel, MathMajor, with more \"serious\" mathematics lecture video, and is associated with his teaching activities: <a rel=\"noopener\" class=\"external-link is-unresolved\" href=\"https://www.youtube.com/@mathmajor\" target=\"_self\">https://www.youtube.com/@mathmajor</a><br><img alt=\"YouTube Michael Penn.png\" src=\"/attachments/youtube-michael-penn.png\" target=\"_self\"><br>Example videos:<br>\n<br><a data-tooltip-position=\"top\" aria-label=\"https://www.youtube.com/watch?v=OAahmA7lr8Q&amp;list=PLVMgvCDIRy1wzJcFNGw7t4tehgzhFtBpm\" rel=\"noopener\" class=\"external-link is-unresolved\" href=\"https://www.youtube.com/watch?v=OAahmA7lr8Q&amp;list=PLVMgvCDIRy1wzJcFNGw7t4tehgzhFtBpm\" target=\"_self\">Complex numbers 1</a>\n<br><br>This is a playlist of the eminent linear algebraist and teacher Gilbert Strang. From MIT Open Courseware.<br>Link: <a rel=\"noopener\" class=\"external-link is-unresolved\" href=\"https://www.youtube.com/playlist?list=PL49CF3715CB9EF31D\" target=\"_self\">https://www.youtube.com/playlist?list=PL49CF3715CB9EF31D</a><br>\n<img alt=\"YouTube Gilbert Strang.png\" src=\"/attachments/youtube-gilbert-strang.png\" target=\"_self\"><br><br>A British mathematician and Fields medalist who has a great reputation as a teacher, and a YouTube channel with many video lectures. According to the description it is \"mostly mathematics lectures for graduate courses on algebraic geometry, commutative algebra, and group/rings fields.\"<br>Link: <a rel=\"noopener\" class=\"external-link is-unresolved\" href=\"https://www.youtube.com/@richarde.borcherds7998\" target=\"_self\">https://www.youtube.com/@richarde.borcherds7998</a><br><img alt=\"YouTube Richard E Borcherds.png\" src=\"/attachments/youtube-richard-e-borcherds.png\" target=\"_self\"><br>Example videos:<br>\n<br><a data-tooltip-position=\"top\" aria-label=\"https://www.youtube.com/watch?v=JOp7mH72Jlg&amp;list=PL8yHsr3EFj51F9XZ_Ka4bLnQoxTdMx0AL\" rel=\"noopener\" class=\"external-link is-unresolved\" href=\"https://www.youtube.com/watch?v=JOp7mH72Jlg&amp;list=PL8yHsr3EFj51F9XZ_Ka4bLnQoxTdMx0AL\" target=\"_self\">Intro to category theory</a>\n<br><a data-tooltip-position=\"top\" aria-label=\"https://www.youtube.com/watch?v=4WmIDodIgac&amp;list=PL8yHsr3EFj52XDLrmvrFDgwcf6XOm2TEE\" rel=\"noopener\" class=\"external-link is-unresolved\" href=\"https://www.youtube.com/watch?v=4WmIDodIgac&amp;list=PL8yHsr3EFj52XDLrmvrFDgwcf6XOm2TEE\" target=\"_self\">Group theory and modules</a>\n<br><br>Link: <a rel=\"noopener\" class=\"external-link is-unresolved\" href=\"http://www.youtube.com/@GraduateMathematics\" target=\"_self\">http://www.youtube.com/@GraduateMathematics</a><br>A channel with a broad variety of videos. I find the old documentaries to be really worthwhile.<br>Video examples:<br>\n<br><a data-tooltip-position=\"top\" aria-label=\"https://www.youtube.com/watch?v=6ymTZEeTjI8&amp;t=32s\" rel=\"noopener\" class=\"external-link is-unresolved\" href=\"https://www.youtube.com/watch?v=6ymTZEeTjI8&amp;t=32s\" target=\"_self\">Fermat's Last Theorem (1993)</a>\n<br><a data-tooltip-position=\"top\" aria-label=\"https://www.youtube.com/watch?v=9634A0iBw7w\" rel=\"noopener\" class=\"external-link is-unresolved\" href=\"https://www.youtube.com/watch?v=9634A0iBw7w\" target=\"_self\">Paul Erdős: The Man Who Loved Only Numbers</a>\n","aliases":[],"tags":[],"headers":[{"heading":"Recommended YouTube channels","level":1,"id":"Recommended YouTube channels"},{"heading":"The Bright Side of Mathematics","level":2,"id":"The_Bright_Side_of_Mathematics"},{"heading":"Michael Penn","level":2,"id":"Michael_Penn"},{"heading":"Gilbert Strang videos on linear algebra","level":2,"id":"Gilbert_Strang_videos_on_linear_algebra"},{"heading":"Richard Borcherds","level":2,"id":"Richard_Borcherds"},{"heading":"Graduate Mathematics","level":2,"id":"Graduate_Mathematics"}],"backlinks":["index.html"],"links":["https://www.youtube.com/@brightsideofmaths","https://jp-g.de","https://www.youtube.com/watch?v=Ob_S-w54f14&list=PLBh2i93oe2quqtKOibchMxIbuLY41RmJa","https://www.youtube.com/watch?v=4QhZTagNq9Q&list=PLBh2i93oe2qv4G2AyarkbR3OKBml0hXEg","https://www.youtube.com/watch?v=pOD5oKpBP-c&list=PLBh2i93oe2qtAFfLUm_dAVcTf3N9McK0U","https://www.youtube.com/watch?v=yDdxFBcvSGw&list=PLBh2i93oe2qsGKDOsuVVw-OCAfprrnGfr","https://www.youtube.com/@MichaelPennMath","https://www.youtube.com/@mathmajor","https://www.youtube.com/watch?v=OAahmA7lr8Q&list=PLVMgvCDIRy1wzJcFNGw7t4tehgzhFtBpm","https://www.youtube.com/playlist?list=PL49CF3715CB9EF31D","https://www.youtube.com/@richarde.borcherds7998","https://www.youtube.com/watch?v=JOp7mH72Jlg&list=PL8yHsr3EFj51F9XZ_Ka4bLnQoxTdMx0AL","https://www.youtube.com/watch?v=4WmIDodIgac&list=PL8yHsr3EFj52XDLrmvrFDgwcf6XOm2TEE","http://www.youtube.com/@GraduateMathematics","https://www.youtube.com/watch?v=6ymTZEeTjI8&t=32s","https://www.youtube.com/watch?v=9634A0iBw7w","recommended-youtube-channels.html#Recommended YouTube channels","recommended-youtube-channels.html#The_Bright_Side_of_Mathematics","recommended-youtube-channels.html#Michael_Penn","recommended-youtube-channels.html#Gilbert_Strang_videos_on_linear_algebra","recommended-youtube-channels.html#Richard_Borcherds","recommended-youtube-channels.html#Graduate_Mathematics"],"author":"","coverImageURL":"","fullURL":"recommended-youtube-channels.html","pathToRoot":"","createdTime":1724744015008,"modifiedTime":1724745286170,"sourceSize":2922,"sourcePath":"Recommended YouTube channels.md","exportPath":"recommended-youtube-channels.html","showInTree":true,"treeOrder":0,"attachments":["attachments/toutube-bright-side-of-mathematics.png","attachments/youtube-michael-penn.png","attachments/youtube-gilbert-strang.png","attachments/youtube-richard-e-borcherds.png"]}},"fileInfo":{"attachments/arfken.png":{"createdTime":1724744015005,"modifiedTime":1724744015006,"sourceSize":253597,"sourcePath":"Attachments/Arfken.png","exportPath":"attachments/arfken.png","showInTree":true,"treeOrder":0},"attachments/blanchard-and-bruening.png":{"createdTime":1724744015008,"modifiedTime":1724744015011,"sourceSize":771451,"sourcePath":"Attachments/Blanchard and Bruening.png","exportPath":"attachments/blanchard-and-bruening.png","showInTree":true,"treeOrder":0},"attachments/butkov.png":{"createdTime":1724744014996,"modifiedTime":1724744014998,"sourceSize":891105,"sourcePath":"Attachments/Butkov.png","exportPath":"attachments/butkov.png","showInTree":true,"treeOrder":0},"attachments/gustafson-and-sigal.png":{"createdTime":1724744015006,"modifiedTime":1724744015008,"sourceSize":378559,"sourcePath":"Attachments/Gustafson and Sigal.png","exportPath":"attachments/gustafson-and-sigal.png","showInTree":true,"treeOrder":0},"attachments/linear-algebra-done-right.png":{"createdTime":1724744015008,"modifiedTime":1724744015008,"sourceSize":134173,"sourcePath":"Attachments/Linear Algebra Done Right.png","exportPath":"attachments/linear-algebra-done-right.png","showInTree":true,"treeOrder":0},"attachments/mathematical-physical-chemistry.png":{"createdTime":1724744014998,"modifiedTime":1724744015003,"sourceSize":681726,"sourcePath":"Attachments/Mathematical Physical Chemistry.png","exportPath":"attachments/mathematical-physical-chemistry.png","showInTree":true,"treeOrder":0},"attachments/set-theory-for-the-working-mathematician.png":{"createdTime":1724744015025,"modifiedTime":1724744015026,"sourceSize":132387,"sourcePath":"Attachments/Set Theory for the Working Mathematician.png","exportPath":"attachments/set-theory-for-the-working-mathematician.png","showInTree":true,"treeOrder":0},"attachments/teschl.png":{"createdTime":1724744015003,"modifiedTime":1724744015005,"sourceSize":610317,"sourcePath":"Attachments/Teschl.png","exportPath":"attachments/teschl.png","showInTree":true,"treeOrder":0},"attachments/toutube-bright-side-of-mathematics.png":{"createdTime":1724744015011,"modifiedTime":1724744015014,"sourceSize":923603,"sourcePath":"Attachments/TouTube Bright Side of Mathematics.png","exportPath":"attachments/toutube-bright-side-of-mathematics.png","showInTree":true,"treeOrder":0},"attachments/youtube-gilbert-strang.png":{"createdTime":1724744015017,"modifiedTime":1724744015024,"sourceSize":988525,"sourcePath":"Attachments/YouTube Gilbert Strang.png","exportPath":"attachments/youtube-gilbert-strang.png","showInTree":true,"treeOrder":0},"attachments/youtube-michael-penn.png":{"createdTime":1724744015014,"modifiedTime":1724744015017,"sourceSize":1161949,"sourcePath":"Attachments/YouTube Michael Penn.png","exportPath":"attachments/youtube-michael-penn.png","showInTree":true,"treeOrder":0},"attachments/youtube-richard-e-borcherds.png":{"createdTime":1724744015024,"modifiedTime":1724744015025,"sourceSize":325920,"sourcePath":"Attachments/YouTube Richard E Borcherds.png","exportPath":"attachments/youtube-richard-e-borcherds.png","showInTree":true,"treeOrder":0},"canvas/mathematics-map.html":{"createdTime":1724744014996,"modifiedTime":1724744014996,"sourceSize":19187,"sourcePath":"Canvas/Mathematics Map.canvas","exportPath":"canvas/mathematics-map.html"},"canvas/quantum-chemistry-map.html":{"createdTime":1724744014996,"modifiedTime":1724744014996,"sourceSize":18467,"sourcePath":"Canvas/Quantum Chemistry Map.canvas","exportPath":"canvas/quantum-chemistry-map.html"},"index.html":{"createdTime":1724744015026,"modifiedTime":1724745101167,"sourceSize":839,"sourcePath":"index.md","exportPath":"index.html"},"mathematics-map-details.html":{"createdTime":1724744014996,"modifiedTime":1724745066634,"sourceSize":18395,"sourcePath":"Mathematics Map Details.md","exportPath":"mathematics-map-details.html"},"recommended-general-mathematics-reading.html":{"createdTime":1724744015008,"modifiedTime":1724745239434,"sourceSize":6477,"sourcePath":"Recommended General Mathematics Reading.md","exportPath":"recommended-general-mathematics-reading.html"},"recommended-youtube-channels.html":{"createdTime":1724744015008,"modifiedTime":1724745286170,"sourceSize":2922,"sourcePath":"Recommended YouTube channels.md","exportPath":"recommended-youtube-channels.html"},"lib/scripts/graph-wasm.wasm":{"createdTime":1724748694084,"modifiedTime":1724748694017.4922,"sourceSize":23377,"sourcePath":"","exportPath":"lib/scripts/graph-wasm.wasm","showInTree":false,"treeOrder":0},"lib/fonts/94f2f163d4b698242fef.otf":{"createdTime":1724749452391,"modifiedTime":1724749452391,"sourceSize":66800,"sourcePath":"","exportPath":"lib/fonts/94f2f163d4b698242fef.otf","showInTree":false,"treeOrder":0},"lib/fonts/72505e6a122c6acd5471.woff2":{"createdTime":1724749452391,"modifiedTime":1724749452391,"sourceSize":104232,"sourcePath":"","exportPath":"lib/fonts/72505e6a122c6acd5471.woff2","showInTree":false,"treeOrder":0},"lib/fonts/2d5198822ab091ce4305.woff2":{"createdTime":1724749452391,"modifiedTime":1724749452391,"sourceSize":104332,"sourcePath":"","exportPath":"lib/fonts/2d5198822ab091ce4305.woff2","showInTree":false,"treeOrder":0},"lib/fonts/c8ba52b05a9ef10f4758.woff2":{"createdTime":1724749452391,"modifiedTime":1724749452391,"sourceSize":98868,"sourcePath":"","exportPath":"lib/fonts/c8ba52b05a9ef10f4758.woff2","showInTree":false,"treeOrder":0},"lib/fonts/cb10ffd7684cd9836a05.woff2":{"createdTime":1724749452392,"modifiedTime":1724749452392,"sourceSize":106876,"sourcePath":"","exportPath":"lib/fonts/cb10ffd7684cd9836a05.woff2","showInTree":false,"treeOrder":0},"lib/fonts/b5f0f109bc88052d4000.woff2":{"createdTime":1724749452392,"modifiedTime":1724749452392,"sourceSize":105804,"sourcePath":"","exportPath":"lib/fonts/b5f0f109bc88052d4000.woff2","showInTree":false,"treeOrder":0},"lib/fonts/cbe0ae49c52c920fd563.woff2":{"createdTime":1724749452392,"modifiedTime":1724749452392,"sourceSize":106108,"sourcePath":"","exportPath":"lib/fonts/cbe0ae49c52c920fd563.woff2","showInTree":false,"treeOrder":0},"lib/fonts/535a6cf662596b3bd6a6.woff2":{"createdTime":1724749452393,"modifiedTime":1724749452393,"sourceSize":111708,"sourcePath":"","exportPath":"lib/fonts/535a6cf662596b3bd6a6.woff2","showInTree":false,"treeOrder":0},"lib/fonts/70cc7ff27245e82ad414.ttf":{"createdTime":1724749452395,"modifiedTime":1724749452395,"sourceSize":192740,"sourcePath":"","exportPath":"lib/fonts/70cc7ff27245e82ad414.ttf","showInTree":false,"treeOrder":0},"lib/fonts/454577c22304619db035.ttf":{"createdTime":1724749452395,"modifiedTime":1724749452395,"sourceSize":161376,"sourcePath":"","exportPath":"lib/fonts/454577c22304619db035.ttf","showInTree":false,"treeOrder":0},"lib/fonts/52ac8f3034507f1d9e53.ttf":{"createdTime":1724749452396,"modifiedTime":1724749452396,"sourceSize":191568,"sourcePath":"","exportPath":"lib/fonts/52ac8f3034507f1d9e53.ttf","showInTree":false,"treeOrder":0},"lib/fonts/05b618077343fbbd92b7.ttf":{"createdTime":1724749452396,"modifiedTime":1724749452396,"sourceSize":155288,"sourcePath":"","exportPath":"lib/fonts/05b618077343fbbd92b7.ttf","showInTree":false,"treeOrder":0},"lib/fonts/4bb6ac751d1c5478ff3a.woff2":{"createdTime":1724749452388,"modifiedTime":1724749452388,"sourceSize":7876,"sourcePath":"","exportPath":"lib/fonts/4bb6ac751d1c5478ff3a.woff2","showInTree":false,"treeOrder":0},"lib/media/874d8b8e340f75575caa.svg":{"createdTime":1724749452388,"modifiedTime":1724749452388,"sourceSize":317,"sourcePath":"","exportPath":"lib/media/874d8b8e340f75575caa.svg","showInTree":false,"treeOrder":0},"lib/fonts/mathjax_zero.woff":{"createdTime":1724749452388,"modifiedTime":1724749452388,"sourceSize":1368,"sourcePath":"","exportPath":"lib/fonts/mathjax_zero.woff","showInTree":false,"treeOrder":0},"lib/fonts/mathjax_main-regular.woff":{"createdTime":1724749452388,"modifiedTime":1724749452388,"sourceSize":34160,"sourcePath":"","exportPath":"lib/fonts/mathjax_main-regular.woff","showInTree":false,"treeOrder":0},"lib/fonts/mathjax_main-bold.woff":{"createdTime":1724749452389,"modifiedTime":1724749452389,"sourceSize":34464,"sourcePath":"","exportPath":"lib/fonts/mathjax_main-bold.woff","showInTree":false,"treeOrder":0},"lib/fonts/mathjax_math-italic.woff":{"createdTime":1724749452389,"modifiedTime":1724749452389,"sourceSize":19360,"sourcePath":"","exportPath":"lib/fonts/mathjax_math-italic.woff","showInTree":false,"treeOrder":0},"lib/fonts/mathjax_main-italic.woff":{"createdTime":1724749452389,"modifiedTime":1724749452389,"sourceSize":20832,"sourcePath":"","exportPath":"lib/fonts/mathjax_main-italic.woff","showInTree":false,"treeOrder":0},"lib/fonts/mathjax_math-bolditalic.woff":{"createdTime":1724749452389,"modifiedTime":1724749452389,"sourceSize":19776,"sourcePath":"","exportPath":"lib/fonts/mathjax_math-bolditalic.woff","showInTree":false,"treeOrder":0},"lib/fonts/mathjax_size1-regular.woff":{"createdTime":1724749452389,"modifiedTime":1724749452389,"sourceSize":5792,"sourcePath":"","exportPath":"lib/fonts/mathjax_size1-regular.woff","showInTree":false,"treeOrder":0},"lib/fonts/mathjax_size2-regular.woff":{"createdTime":1724749452389,"modifiedTime":1724749452389,"sourceSize":5464,"sourcePath":"","exportPath":"lib/fonts/mathjax_size2-regular.woff","showInTree":false,"treeOrder":0},"lib/fonts/mathjax_size3-regular.woff":{"createdTime":1724749452389,"modifiedTime":1724749452389,"sourceSize":3244,"sourcePath":"","exportPath":"lib/fonts/mathjax_size3-regular.woff","showInTree":false,"treeOrder":0},"lib/fonts/mathjax_size4-regular.woff":{"createdTime":1724749452389,"modifiedTime":1724749452389,"sourceSize":5148,"sourcePath":"","exportPath":"lib/fonts/mathjax_size4-regular.woff","showInTree":false,"treeOrder":0},"lib/fonts/mathjax_ams-regular.woff":{"createdTime":1724749452389,"modifiedTime":1724749452389,"sourceSize":40808,"sourcePath":"","exportPath":"lib/fonts/mathjax_ams-regular.woff","showInTree":false,"treeOrder":0},"lib/fonts/mathjax_calligraphic-regular.woff":{"createdTime":1724749452389,"modifiedTime":1724749452389,"sourceSize":9600,"sourcePath":"","exportPath":"lib/fonts/mathjax_calligraphic-regular.woff","showInTree":false,"treeOrder":0},"lib/fonts/mathjax_calligraphic-bold.woff":{"createdTime":1724749452389,"modifiedTime":1724749452389,"sourceSize":9908,"sourcePath":"","exportPath":"lib/fonts/mathjax_calligraphic-bold.woff","showInTree":false,"treeOrder":0},"lib/fonts/mathjax_fraktur-regular.woff":{"createdTime":1724749452389,"modifiedTime":1724749452389,"sourceSize":21480,"sourcePath":"","exportPath":"lib/fonts/mathjax_fraktur-regular.woff","showInTree":false,"treeOrder":0},"lib/fonts/mathjax_fraktur-bold.woff":{"createdTime":1724749452389,"modifiedTime":1724749452389,"sourceSize":22340,"sourcePath":"","exportPath":"lib/fonts/mathjax_fraktur-bold.woff","showInTree":false,"treeOrder":0},"lib/fonts/mathjax_sansserif-regular.woff":{"createdTime":1724749452389,"modifiedTime":1724749452389,"sourceSize":12660,"sourcePath":"","exportPath":"lib/fonts/mathjax_sansserif-regular.woff","showInTree":false,"treeOrder":0},"lib/fonts/mathjax_sansserif-bold.woff":{"createdTime":1724749452390,"modifiedTime":1724749452390,"sourceSize":15944,"sourcePath":"","exportPath":"lib/fonts/mathjax_sansserif-bold.woff","showInTree":false,"treeOrder":0},"lib/fonts/mathjax_sansserif-italic.woff":{"createdTime":1724749452390,"modifiedTime":1724749452390,"sourceSize":14628,"sourcePath":"","exportPath":"lib/fonts/mathjax_sansserif-italic.woff","showInTree":false,"treeOrder":0},"lib/fonts/mathjax_script-regular.woff":{"createdTime":1724749452390,"modifiedTime":1724749452390,"sourceSize":11852,"sourcePath":"","exportPath":"lib/fonts/mathjax_script-regular.woff","showInTree":false,"treeOrder":0},"lib/fonts/mathjax_typewriter-regular.woff":{"createdTime":1724749452390,"modifiedTime":1724749452390,"sourceSize":17604,"sourcePath":"","exportPath":"lib/fonts/mathjax_typewriter-regular.woff","showInTree":false,"treeOrder":0},"lib/fonts/mathjax_vector-regular.woff":{"createdTime":1724749452390,"modifiedTime":1724749452390,"sourceSize":1136,"sourcePath":"","exportPath":"lib/fonts/mathjax_vector-regular.woff","showInTree":false,"treeOrder":0},"lib/fonts/mathjax_vector-bold.woff":{"createdTime":1724749452390,"modifiedTime":1724749452390,"sourceSize":1116,"sourcePath":"","exportPath":"lib/fonts/mathjax_vector-bold.woff","showInTree":false,"treeOrder":0},"lib/html/file-tree.html":{"createdTime":1724749452514,"modifiedTime":1724749452514,"sourceSize":8746,"sourcePath":"","exportPath":"lib/html/file-tree.html","showInTree":false,"treeOrder":0},"lib/scripts/webpage.js":{"createdTime":1724748695042,"modifiedTime":1724748695042,"sourceSize":49059,"sourcePath":"","exportPath":"lib/scripts/webpage.js","showInTree":false,"treeOrder":0},"lib/scripts/graph-view.js":{"createdTime":1724748695042,"modifiedTime":1724748695042,"sourceSize":15519,"sourcePath":"","exportPath":"lib/scripts/graph-view.js","showInTree":false,"treeOrder":0},"lib/scripts/graph-wasm.js":{"createdTime":1724748695042,"modifiedTime":1724748695042,"sourceSize":14021,"sourcePath":"","exportPath":"lib/scripts/graph-wasm.js","showInTree":false,"treeOrder":0},"lib/scripts/graph-render-worker.js":{"createdTime":1724748695042,"modifiedTime":1724748695042,"sourceSize":5179,"sourcePath":"","exportPath":"lib/scripts/graph-render-worker.js","showInTree":false,"treeOrder":0},"lib/scripts/tinycolor.js":{"createdTime":1724748695042,"modifiedTime":1724748695042,"sourceSize":29832,"sourcePath":"","exportPath":"lib/scripts/tinycolor.js","showInTree":false,"treeOrder":0},"lib/scripts/pixi.js":{"createdTime":1724748695043,"modifiedTime":1724748695043,"sourceSize":449509,"sourcePath":"","exportPath":"lib/scripts/pixi.js","showInTree":false,"treeOrder":0},"lib/scripts/minisearch.js":{"createdTime":1724748695043,"modifiedTime":1724748695043,"sourceSize":29422,"sourcePath":"","exportPath":"lib/scripts/minisearch.js","showInTree":false,"treeOrder":0},"lib/media/favicon.png":{"createdTime":1724749452373,"modifiedTime":1724749452373,"sourceSize":1105,"sourcePath":"","exportPath":"lib/media/favicon.png","showInTree":false,"treeOrder":0},"lib/scripts/graph-data.js":{"createdTime":1724749452515,"modifiedTime":1724749452515,"sourceSize":665,"sourcePath":"","exportPath":"lib/scripts/graph-data.js","showInTree":false,"treeOrder":0},"lib/styles/obsidian.css":{"createdTime":1724749452488,"modifiedTime":1724749452488,"sourceSize":364672,"sourcePath":"","exportPath":"lib/styles/obsidian.css","showInTree":false,"treeOrder":0},"lib/styles/global-variable-styles.css":{"createdTime":1724749452376,"modifiedTime":1724749452376,"sourceSize":236,"sourcePath":"","exportPath":"lib/styles/global-variable-styles.css","showInTree":false,"treeOrder":0},"lib/styles/main-styles.css":{"createdTime":1724748695061,"modifiedTime":1724748695061,"sourceSize":19271,"sourcePath":"","exportPath":"lib/styles/main-styles.css","showInTree":false,"treeOrder":0},"lib/styles/snippets.css":{"createdTime":1724749452495,"modifiedTime":1724749452495,"sourceSize":378,"sourcePath":"","exportPath":"lib/styles/snippets.css","showInTree":false,"treeOrder":0},"lib/metadata.json":{"createdTime":1724749457990,"modifiedTime":1724749457990,"sourceSize":104569,"sourcePath":"","exportPath":"lib/metadata.json","showInTree":false,"treeOrder":0},"lib/search-index.json":{"createdTime":1724749457991,"modifiedTime":1724749457991,"sourceSize":50352,"sourcePath":"","exportPath":"lib/search-index.json","showInTree":false,"treeOrder":0}},"sourceToTarget":{"Attachments/Arfken.png":"attachments/arfken.png","Attachments/Blanchard and Bruening.png":"attachments/blanchard-and-bruening.png","Attachments/Butkov.png":"attachments/butkov.png","Attachments/Gustafson and Sigal.png":"attachments/gustafson-and-sigal.png","Attachments/Linear Algebra Done Right.png":"attachments/linear-algebra-done-right.png","Attachments/Mathematical Physical Chemistry.png":"attachments/mathematical-physical-chemistry.png","Attachments/Set Theory for the Working Mathematician.png":"attachments/set-theory-for-the-working-mathematician.png","Attachments/Teschl.png":"attachments/teschl.png","Attachments/TouTube Bright Side of Mathematics.png":"attachments/toutube-bright-side-of-mathematics.png","Attachments/YouTube Gilbert Strang.png":"attachments/youtube-gilbert-strang.png","Attachments/YouTube Michael Penn.png":"attachments/youtube-michael-penn.png","Attachments/YouTube Richard E Borcherds.png":"attachments/youtube-richard-e-borcherds.png","Canvas/Mathematics Map.canvas":"canvas/mathematics-map.html","Canvas/Quantum Chemistry Map.canvas":"canvas/quantum-chemistry-map.html","index.md":"index.html","Mathematics Map Details.md":"mathematics-map-details.html","Recommended General Mathematics Reading.md":"recommended-general-mathematics-reading.html","Recommended YouTube channels.md":"recommended-youtube-channels.html","":"lib/search-index.json"},"modifiedTime":1724749452496,"siteName":"ESQC Math Obsidian Vault","exportRoot":"/","pluginVersion":"1.9.0-2b","themeName":"Default","bodyClasses":"publish css-settings-manager theme-dark native-scrollbars show-inline-title show-ribbon is-focused","addCustomHead":false,"addFavicon":false}